symbolic-integration-1-transcendental-functions.org
#+PROPERTY: header-args :exports both :eval never-export

[[cite:05:_symbol_integ_i][Symbolic Integration 1: Transcendental Functions]]

* Foreword
Thus these two visions (mathematical and computational) set the stage
for a century and a half of research that *partially culminates* in
this book.

The use of these algebraic ideas (of Ritt) were brought to further
fruition by Kolchin, Rosenlicht, and, particularly for problems of
symbolic integration, by three of Rosenlicht's Ph.D. students ---
*Risch*, Singer, and *Bronstein*.

But yet none of the systems had a complete implementation of the full
algorithm that Risch had announced in barest outline in 1970.  There
were a number of reasons for this.  First and foremost, no one had
worked out the many aspects of the problem that Risch's announcement
left incomplete.

Starting with his Ph.D. dissertation and continuing in a series of
beautiful and important papers, *Bronstein* set out to fill in the
missing components of Risch's 1970 announcement.  Meanwhile working at
the *IBM T. J. Watson Research Center (a.k.a AXIOM)*, he carried out
an almost complete implementation of the integration algorithm for
elementary functions.  It is *the most complete implementation* of
symbolic integration algorithms to date.

I expect this book to be the standard starting place for future
implementers of symbolic integration algorithms.  Along with the
algorithms, he presents the mathematics necessary to show that the
algorithms work correctly.  This is a very interesting story in its
own right and Bronstein tells it well.  Nonetheless, for those
primarily interested in the algorithms, much of the mathematics can be
skipped at least in a first study.  But the full beauty of the subject
is to be most appreciated by studying both aspects.

The full treatment of the subject is a long one and it is not finished
in this volume.  The longer and more difficult part involving the
integration of algebraic functions must await a second volume.  This
volume serves as a good foundation to the topic of symbolic
integration and as a nice introduction to the literature for
integration of algebraic functions and for other aspects such as
integration involving non-elementary functions.  Study, learn,
implement, and enjoy!

B. F. Caviness

* Preface to the First Edition
The inverse problem (symbolic integration) has been challenging
scientists since the time of Leibniz and Newton, and is still a
challenge for mathematicians and computer scientists today.

Most calculus and analysis textbooks give students the impression that
integration is at best a mixture of art and science, with flair in
choosing the right change of variable or approach being an essential
ingredient, as well as a comprehensive table of integrals.

This procedure, which Risch described in a series of reports,
unfortunately not all of them published, forms the basis of most of
the symbolic integration algorithms of the past 20 years, all of them
loosely grouped under the appellation /Risch algorithm/.

Our main sources besides Risch being [[cite:bronstein90:_risch][12]], [[cite:bronstein90:_liouv][13]], [[cite:rothstein1977new][83]], [[cite:Trager:1976:AFR:800205.806338][89]].

Including algorithms for integrating algebraic and mixed
algebraic-transcendental functions would however easily double the
size of this book, as well as increase the mathematical prerequisites,
since those algorithms require prior familiarity with algebraic curves
and functions.  We have thus decided to cover algebraic functions in a
second volume, which will hopefully appear in the near future.  In the
meantime, this book is an adequate preparation to the extensive
literature on the integration of algebraic functions [8, 9], [[cite:bronstein90:_integ][11]], [[cite:Bronstein:1991:RDE:120694.120731][14]],
[[cite:davenport81:_integ_algeb_funct][29]], [[cite:risch1968integration][73]], [[cite:risch1969further][74]], [[cite:trager1984integration][91]].

Zurich, November 1996   M. Bronstein

* 1 Algebraic Preliminaries
** 1.1 Groups, Rings and Fields
An algebraic structure is usually a set together with one or more
operations on it, operations that satisfy some computation rules
called axioms.  In order not to always list all the satisfied axioms
for a given structure, short names have been given to the most common
structures.

