symbolic-integration-1-transcendental-functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-25 Thu 20:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64badca">1. Foreword</a></li>
<li><a href="#org4974a6b">2. Preface to the First Edition</a></li>
<li><a href="#orgb0f313b">3. 1 Algebraic Preliminaries</a>
<ul>
<li><a href="#org954a442">3.1. 1.1 Groups, Rings and Fields</a>
<ul>
<li><a href="#org704fadb">3.1.1. Definition 1.1.1 Group</a></li>
<li><a href="#org00a73c7">3.1.2. Example 1.1.1 Group</a></li>
<li><a href="#org8d26dbc">3.1.3. Example 1.1.2 AbelianGroup</a></li>
<li><a href="#org681484a">3.1.4. Definition 1.1.2 Ring</a></li>
<li><a href="#org7a99d1f">3.1.5. Example 1.1.3 Ring</a></li>
<li><a href="#org0319771">3.1.6. Example 1.1.4 CommutativeRing</a></li>
<li><a href="#org5f8940e">3.1.7. Definition 1.1.3 IntegralDomain</a></li>
<li><a href="#org47ad6f3">3.1.8. Example 1.1.5 IntegralDomain</a></li>
<li><a href="#org4e5d7bc">3.1.9. Definition 1.1.4 GcdDomain</a></li>
<li><a href="#orgf1e1846">3.1.10. Example 1.1.6 GcdDomain</a></li>
<li><a href="#orge5ea859">3.1.11. Definition 1.1.5 prime</a></li>
<li><a href="#org6e36df3">3.1.12. Example 1.1.7</a></li>
<li><a href="#orgcc43d6f">3.1.13. Definition 1.1.6 UFD</a></li>
<li><a href="#org12ca0b9">3.1.14. Example 1.1.8 UFD</a></li>
<li><a href="#org9ef92d4">3.1.15. Theorem 1.1.3</a></li>
<li><a href="#org257940a">3.1.16. Theorem 1.1.4</a></li>
<li><a href="#org6937f7c">3.1.17. Definition 1.1.7 subgroup</a></li>
<li><a href="#orgd1898cb">3.1.18. Example 1.1.9 subgroup</a></li>
<li><a href="#org0dd1c29">3.1.19. Definition 1.1.8 Ideal</a></li>
<li><a href="#orgfb9cbd4">3.1.20. Theorem 1.1.5</a></li>
<li><a href="#org179829a">3.1.21. Example 1.1.10 principalIdeal</a></li>
<li><a href="#org748d920">3.1.22. Definition 1.1.9 PID</a></li>
<li><a href="#org00d651f">3.1.23. Example 1.1.11 PID</a></li>
<li><a href="#org1e7ada0">3.1.24. Definition 1.1.10 EuclideanDomain</a></li>
<li><a href="#orgeb7fc6d">3.1.25. Example 1.1.12 EuclideanDomain</a></li>
<li><a href="#orgab9e526">3.1.26. Theorem 1.1.6</a></li>
<li><a href="#org0048568">3.1.27. Theorem 1.1.7</a></li>
<li><a href="#org1d90403">3.1.28. Definition 1.1.11 Field</a></li>
<li><a href="#org4a11e9e">3.1.29. Example 1.1.13 Field</a></li>
<li><a href="#org0441635">3.1.30. Example 1.1.14 Field</a></li>
<li><a href="#org775f799">3.1.31. Definition 1.1.12 SimpleAlgebraicExtension</a></li>
<li><a href="#orgf0fd717">3.1.32. Definition 1.1.13 AlgebraicallyClosedField</a></li>
<li><a href="#org6875358">3.1.33. Theorem 1.1.9</a></li>
<li><a href="#org83a5cb9">3.1.34. Theorem 1.1.10</a></li>
<li><a href="#orgfc189ed">3.1.35. Theorem 1.1.11</a></li>
</ul>
</li>
<li><a href="#org8b7577f">3.2. 1.2 Euclidean Division and Pseudo-Division</a>
<ul>
<li><a href="#org589a64e">3.2.1. Algorithm: PolyDivide</a></li>
<li><a href="#org2cc0e3d">3.2.2. Example 1.2.1 PolyDivide</a></li>
<li><a href="#org749dc38">3.2.3. Algorithm: PolyPseudoDivide</a></li>
<li><a href="#orgacb0a84">3.2.4. Example 1.2.2 PolyPseudoDivide</a></li>
</ul>
</li>
<li><a href="#orgc713274">3.3. 1.3 The Euclidean Algorithm</a>
<ul>
<li><a href="#orgab5159c">3.3.1. Example 1.3.1 EuclideanDivision</a></li>
<li><a href="#org004f811">3.3.2. Example 1.3.2 ExtendedEuclidean</a></li>
<li><a href="#org306808d">3.3.3. Example 1.3.3</a></li>
<li><a href="#orgd5e1548">3.3.4. Example 1.3.4</a></li>
<li><a href="#orga636e31">3.3.5. Example 1.3.5</a></li>
<li><a href="#org13f58a5">3.3.6. Example 1.3.6 PartialFraction</a></li>
<li><a href="#org5b6a5c3">3.3.7. Example 1.3.7 FullPartialFraction</a></li>
</ul>
</li>
<li><a href="#org555e396">3.4. 1.4 Resultants and Subresultants</a>
<ul>
<li><a href="#orgf6fb9c9">3.4.1. Definition 1.4.1 Sylvester Matrix</a></li>
<li><a href="#org403d349">3.4.2. Example 1.4.1 Resultant</a></li>
<li><a href="#org77c9589">3.4.3. Theorem 1.4.1 Resultant</a></li>
<li><a href="#org49e34b2">3.4.4. Theorem 1.4.2 resultantEuclidean</a></li>
<li><a href="#org24b7ca2">3.4.5. Example 1.4.2 Subresultant</a></li>
<li><a href="#orgbd69401">3.4.6. Example 1.4.3</a></li>
</ul>
</li>
<li><a href="#orge6fc4fd">3.5. 1.5 Polynomial Remainder Sequences</a>
<ul>
<li><a href="#orgd3f2ea6">3.5.1. Definition 1.5.1 Polynomial Remainder Sequence</a></li>
<li><a href="#org009381d">3.5.2. Example 1.5.1</a></li>
<li><a href="#org9c06682">3.5.3. Example 1.5.2</a></li>
</ul>
</li>
<li><a href="#org3835c26">3.6. 1.6 Primitive Polynomials</a>
<ul>
<li><a href="#orgf2a288c">3.6.1. Definition 1.6.1 content, primitivePart</a></li>
<li><a href="#org6280e8e">3.6.2. Definition 1.6.2 suqareFreePart</a></li>
</ul>
</li>
<li><a href="#orga826af0">3.7. 1.7 Squarefree Factorization</a>
<ul>
<li><a href="#orgc20c0c5">3.7.1. Definition 1.7.2 squareFree</a></li>
<li><a href="#orgc61fefd">3.7.2. Example 1.7.1 squareFree</a></li>
<li><a href="#org4919cdb">3.7.3. Example 1.7.2 squareFree</a></li>
</ul>
</li>
<li><a href="#orgb79ffd6">3.8. Exercises</a>
<ul>
<li><a href="#org92bcf1f">3.8.1. Exercise 1.1</a></li>
<li><a href="#orgee50795">3.8.2. Exercise 1.2</a></li>
<li><a href="#org4b41dbe">3.8.3. Exercise 1.3</a></li>
<li><a href="#org2944c9f">3.8.4. Exercise 1.4</a></li>
<li><a href="#org4b0d893">3.8.5. Exercise 1.5</a></li>
<li><a href="#org1edb076">3.8.6. Exercise 1.6</a></li>
<li><a href="#org577bc0a">3.8.7. Exercise 1.7</a></li>
<li><a href="#orgdfd72a0">3.8.8. Exercise 1.8</a></li>
<li><a href="#orgfff3d53">3.8.9. Exercise 1.9</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a class='org-ref-reference' href="#05:_symbol_integ_i">05:_symbol_integ_i</a>
</p>

<div id="outline-container-org64badca" class="outline-2">
<h2 id="org64badca"><span class="section-number-2">1</span> Foreword</h2>
<div class="outline-text-2" id="text-1">
<p>
Thus these two visions (mathematical and computational) set the stage
for a century and a half of research that <b>partially culminates</b> in
this book.
</p>

<p>
The use of these algebraic ideas (of Ritt) were brought to further
fruition by Kolchin, Rosenlicht, and, particularly for problems of
symbolic integration, by three of Rosenlicht's Ph.D. students &#x2014;
<b>Risch</b>, Singer, and <b>Bronstein</b>.
</p>

<p>
But yet none of the systems had a complete implementation of the full
algorithm that Risch had announced in barest outline in 1970.  There
were a number of reasons for this.  First and foremost, no one had
worked out the many aspects of the problem that Risch's announcement
left incomplete.
</p>

<p>
Starting with his Ph.D. dissertation and continuing in a series of
beautiful and important papers, <b>Bronstein</b> set out to fill in the
missing components of Risch's 1970 announcement.  Meanwhile working at
the <b>IBM T. J. Watson Research Center (a.k.a AXIOM)</b>, he carried out
an almost complete implementation of the integration algorithm for
elementary functions.  It is <b>the most complete implementation</b> of
symbolic integration algorithms to date.
</p>

<p>
I expect this book to be the standard starting place for future
implementers of symbolic integration algorithms.  Along with the
algorithms, he presents the mathematics necessary to show that the
algorithms work correctly.  This is a very interesting story in its
own right and Bronstein tells it well.  Nonetheless, for those
primarily interested in the algorithms, much of the mathematics can be
skipped at least in a first study.  But the full beauty of the subject
is to be most appreciated by studying both aspects.
</p>

<p>
The full treatment of the subject is a long one and it is not finished
in this volume.  The longer and more difficult part involving the
integration of algebraic functions must await a second volume.  This
volume serves as a good foundation to the topic of symbolic
integration and as a nice introduction to the literature for
integration of algebraic functions and for other aspects such as
integration involving non-elementary functions.  Study, learn,
implement, and enjoy!
</p>

<p>
B. F. Caviness
</p>
</div>
</div>

<div id="outline-container-org4974a6b" class="outline-2">
<h2 id="org4974a6b"><span class="section-number-2">2</span> Preface to the First Edition</h2>
<div class="outline-text-2" id="text-2">
<p>
The inverse problem (symbolic integration) has been challenging
scientists since the time of Leibniz and Newton, and is still a
challenge for mathematicians and computer scientists today.
</p>

<p>
Most calculus and analysis textbooks give students the impression that
integration is at best a mixture of art and science, with flair in
choosing the right change of variable or approach being an essential
ingredient, as well as a comprehensive table of integrals.
</p>

<p>
This procedure, which Risch described in a series of reports,
unfortunately not all of them published, forms the basis of most of
the symbolic integration algorithms of the past 20 years, all of them
loosely grouped under the appellation <i>Risch algorithm</i>.
</p>

<p>
Our main sources besides Risch being <a class='org-ref-reference' href="#bronstein90:_risch">bronstein90:_risch</a>, <a class='org-ref-reference' href="#bronstein90:_liouv">bronstein90:_liouv</a>, <a class='org-ref-reference' href="#rothstein1977new">rothstein1977new</a>, <a class='org-ref-reference' href="#Trager:1976:AFR:800205.806338">Trager:1976:AFR:800205.806338</a>.
</p>

<p>
Including algorithms for integrating algebraic and mixed
algebraic-transcendental functions would however easily double the
size of this book, as well as increase the mathematical prerequisites,
since those algorithms require prior familiarity with algebraic curves
and functions.  We have thus decided to cover algebraic functions in a
second volume, which will hopefully appear in the near future.  In the
meantime, this book is an adequate preparation to the extensive
literature on the integration of algebraic functions [8, 9], <a class='org-ref-reference' href="#bronstein90:_integ">bronstein90:_integ</a>, <a class='org-ref-reference' href="#Bronstein:1991:RDE:120694.120731">Bronstein:1991:RDE:120694.120731</a>,
<a class='org-ref-reference' href="#davenport81:_integ_algeb_funct">davenport81:_integ_algeb_funct</a>, <a class='org-ref-reference' href="#risch1968integration">risch1968integration</a>, <a class='org-ref-reference' href="#risch1969further">risch1969further</a>, <a class='org-ref-reference' href="#trager1984integration">trager1984integration</a>.
</p>

<p>
Zurich, November 1996   M. Bronstein
</p>
</div>
</div>

<div id="outline-container-orgb0f313b" class="outline-2">
<h2 id="orgb0f313b"><span class="section-number-2">3</span> 1 Algebraic Preliminaries</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org954a442" class="outline-3">
<h3 id="org954a442"><span class="section-number-3">3.1</span> 1.1 Groups, Rings and Fields</h3>
<div class="outline-text-3" id="text-3-1">
<p>
An algebraic structure is usually a set together with one or more
operations on it, operations that satisfy some computation rules
called axioms.  In order not to always list all the satisfied axioms
for a given structure, short names have been given to the most common
structures.
</p>
</div>
