symbolic-integration-1-transcendental-functions.org
*** Definition 1.1.1 Group
#+BEGIN_QUOTE
[[~/github/fricas/src/algebra/catdef.spad::category SGROUP]]

SemiGroup == SetCategory with "*" ...

[[~/github/fricas/src/algebra/catdef.spad::category MONOID]]

Monoid == SemiGroup with 1 ...

[[~/github/fricas/src/algebra/catdef.spad::category GROUP]]

Group == Join(Monoid, unitsKnown) with inv ...
#+END_QUOTE

#+BEGIN_SRC axiom
-- (i) Associativity
Group has SemiGroup
-- SemiGroup ?has? "*": (%, %) -> %
-- SemiGroup satisfies (i)

-- (ii) Identity element
Group has Monoid
-- Monoid ?has? 1 : constant -> %
-- Monoid satisfies (i) and (ii)

-- (iii) Inverses
-- Group ?has? inv : (% -> %)
#+END_SRC

#+RESULTS:
#+begin_example
-> -- (i) Associativity
-> Group has SemiGroup

   true
                                                                Type: Boolean
-> -- SemiGroup ?has? "*": (%, %) -> %
-> -- SemiGroup satisfies (i)
-> -- (ii) Identity element
-> Group has Monoid

   true
                                                                Type: Boolean
-> -- Monoid ?has? 1 : constant -> %
-> -- Monoid satisfies (i) and (ii)
-> -- (iii) Inverses
-> -- Group ?has? inv : (% -> %)

#+end_example

#+BEGIN_SRC axiom
)show Group
#+END_SRC

#+RESULTS:
#+begin_example
-> )show Group
 Group is a category constructor
 Abbreviation for Group is GROUP
 This constructor is exposed in this frame.
─────────────────────────────── Operations ────────────────────────────────
 ?*? : (%,%) -> %                      ?/? : (%,%) -> %
 ?=? : (%,%) -> Boolean                1 : () -> %
 ?^? : (%,Integer) -> %                ?^? : (%,PositiveInteger) -> %
 coerce : % -> OutputForm              commutator : (%,%) -> %
 conjugate : (%,%) -> %                hash : % -> SingleInteger
 inv : % -> %                          latex : % -> String
 one? : % -> Boolean                   recip : % -> Union(%,"failed")
 sample : () -> %                      ?~=? : (%,%) -> Boolean
 ?^? : (%,NonNegativeInteger) -> %
 hashUpdate! : (HashState,%) -> HashState


#+end_example

#+BEGIN_ASCII
NOTE BY ME:
In FriCAS, there are two "kinds" of Group:

One uses "*" as its associative operation, thus SemiGroup, Monoid, and
Group.

Another uses "+" as its associative and commutative operation, thus
AbelianSemiGroup, AbelianMonoid, (CancellationAbelianMonoid),
AbelianGroup.

Thus "+" is always commutative, while "*" not necessarily.  And
CommutativeStar is rarely used, almost exclusively used in
CommutativeRing.
#+END_ASCII

*** Example 1.1.1 Group
#+BEGIN_SRC axiom
SquareMatrix(2, FRAC INT) has Group
-- SquareMatrix with nonzero determinant can not be expressed in FriCAS?
-- Or use SubDomain?
SquareMatrix(2, FRAC INT) has Monoid
#+END_SRC

#+RESULTS:
#+begin_example
-> SquareMatrix(2, FRAC INT) has Group

   false
                                                                Type: Boolean
-> -- SquareMatrix with nonzero determinant can not be expressed in FriCAS?
-> -- Or use SubDomain?
-> SquareMatrix(2, FRAC INT) has Monoid

   true
                                                                Type: Boolean

#+end_example

*** Example 1.1.2 AbelianGroup
#+BEGIN_SRC axiom
SquareMatrix(2, FRAC INT) has AbelianGroup

1$SquareMatrix(2, FRAC INT)

0$SquareMatrix(2, FRAC INT)
#+END_SRC

#+RESULTS:
#+begin_example
-> SquareMatrix(2, FRAC INT) has AbelianGroup

   true
                                                                Type: Boolean
-> 1$SquareMatrix(2, FRAC INT)

   ┌1  0┐
   │    │
   └0  1┘
                                      Type: SquareMatrix(2,Fraction(Integer))
-> 0$SquareMatrix(2, FRAC INT)

   ┌0  0┐
   │    │
   └0  0┘
                                      Type: SquareMatrix(2,Fraction(Integer))

#+end_example

