symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org704fadb" class="outline-4">
<h4 id="org704fadb"><span class="section-number-4">3.1.1</span> Definition 1.1.1 Group</h4>
<div class="outline-text-4" id="text-3-1-1">
<blockquote>
<p>
<a href="file:///fricas/src/algebra/catdef.spad">file:///fricas/src/algebra/catdef.spad</a> ::category SGROUP
</p>

<p>
SemiGroup == SetCategory with "*" &#x2026;
</p>

<p>
<a href="file:///fricas/src/algebra/catdef.spad">file:///fricas/src/algebra/catdef.spad</a> ::category MONOID
</p>

<p>
Monoid == SemiGroup with 1 &#x2026;
</p>

<p>
<a href="file:///fricas/src/algebra/catdef.spad">file:///fricas/src/algebra/catdef.spad</a> ::category GROUP
</p>

<p>
Group == Join(Monoid, unitsKnown) with inv &#x2026;
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- (i) Associativity</span>
<span style="color: #ce537a; font-weight: bold;">Group</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">SemiGroup</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- SemiGroup ?has? "*": (%, %) -&gt; %</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- SemiGroup satisfies (i)</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- (ii) Identity element</span>
<span style="color: #ce537a; font-weight: bold;">Group</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Monoid</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- Monoid ?has? 1 : constant -&gt; %</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- Monoid satisfies (i) and (ii)</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- (iii) Inverses</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- Group ?has? inv : (% -&gt; %)</span>
</pre>
</div>

<pre class="example" id="orgff3f462">
-&gt; -- (i) Associativity
-&gt; Group has SemiGroup

   true
                                                                Type: Boolean
-&gt; -- SemiGroup ?has? "*": (%, %) -&gt; %
-&gt; -- SemiGroup satisfies (i)
-&gt; -- (ii) Identity element
-&gt; Group has Monoid

   true
                                                                Type: Boolean
-&gt; -- Monoid ?has? 1 : constant -&gt; %
-&gt; -- Monoid satisfies (i) and (ii)
-&gt; -- (iii) Inverses
-&gt; -- Group ?has? inv : (% -&gt; %)

</pre>

<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #e0211d; text-decoration: overline;">)</span>show <span style="color: #ce537a; font-weight: bold;">Group</span>
</pre>
</div>

<pre class="example" id="org55bb57c">
-&gt; )show Group
 Group is a category constructor
 Abbreviation for Group is GROUP
 This constructor is exposed in this frame.
─────────────────────────────── Operations ────────────────────────────────
 ?*? : (%,%) -&gt; %                      ?/? : (%,%) -&gt; %
 ?=? : (%,%) -&gt; Boolean                1 : () -&gt; %
 ?^? : (%,Integer) -&gt; %                ?^? : (%,PositiveInteger) -&gt; %
 coerce : % -&gt; OutputForm              commutator : (%,%) -&gt; %
 conjugate : (%,%) -&gt; %                hash : % -&gt; SingleInteger
 inv : % -&gt; %                          latex : % -&gt; String
 one? : % -&gt; Boolean                   recip : % -&gt; Union(%,"failed")
 sample : () -&gt; %                      ?~=? : (%,%) -&gt; Boolean
 ?^? : (%,NonNegativeInteger) -&gt; %
 hashUpdate! : (HashState,%) -&gt; HashState


</pre>

<div class="ASCII" id="orgeac192f">
<p>
NOTE BY ME:
In FriCAS, there are two "kinds" of Group:
</p>

<p>
One uses "*" as its associative operation, thus SemiGroup, Monoid, and
Group.
</p>

<p>
Another uses "+" as its associative and commutative operation, thus
AbelianSemiGroup, AbelianMonoid, (CancellationAbelianMonoid),
AbelianGroup.
</p>

<p>
Thus "+" is always commutative, while "*" not necessarily.  And
CommutativeStar is rarely used, almost exclusively used in
CommutativeRing.
</p>

</div>
</div>
</div>

<div id="outline-container-org00a73c7" class="outline-4">
<h4 id="org00a73c7"><span class="section-number-4">3.1.2</span> Example 1.1.1 Group</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Group</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- SquareMatrix with nonzero determinant can not be expressed in FriCAS?</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- Or use SubDomain?</span>
<span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Monoid</span>
</pre>
</div>

<pre class="example" id="orgdce9121">
-&gt; SquareMatrix(2, FRAC INT) has Group

   false
                                                                Type: Boolean
-&gt; -- SquareMatrix with nonzero determinant can not be expressed in FriCAS?
-&gt; -- Or use SubDomain?
-&gt; SquareMatrix(2, FRAC INT) has Monoid

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org8d26dbc" class="outline-4">
<h4 id="org8d26dbc"><span class="section-number-4">3.1.3</span> Example 1.1.2 AbelianGroup</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">AbelianGroup</span>

<span style="color: #a45bad;">1</span>$<span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>

<span style="color: #a45bad;">0</span>$<span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org85ceefe">
-&gt; SquareMatrix(2, FRAC INT) has AbelianGroup

   true
                                                                Type: Boolean
-&gt; 1$SquareMatrix(2, FRAC INT)

   ┌1  0┐
   │    │
   └0  1┘
                                      Type: SquareMatrix(2,Fraction(Integer))
-&gt; 0$SquareMatrix(2, FRAC INT)

   ┌0  0┐
   │    │
   └0  0┘
                                      Type: SquareMatrix(2,Fraction(Integer))

</pre>
</div>
</div>
