symbolic-integration-1-transcendental-functions.org
*** Definition 1.1.2 Ring
#+BEGIN_SRC axiom
-- Ring      == Join(Rng, SemiRing, LeftModule(%), unitsKnown) with characteristic
--  SemiRing == Join(SemiRng, AbelianMonoid, Monoid)
--  Rng      == Join(SemiRng, AbelianGroup) with
--   SemiRng == Join(AbelianSemiGroup, SemiGroup)
-- (i) Commutative group (over +)
Ring has AbelianGroup
-- This property is provided by: Rng
-- (ii) Associativity (over *)
Ring has SemiGroup
-- This property is provided by both
-- (iii) Multiplicative identity
Ring has Monoid
-- This property is provided by: SemiRng
-- (iv) Distributivity
Ring has Rng
-- This property is provided by: Rng
#+END_SRC

#+RESULTS:
#+begin_example
-> -- Ring      == Join(Rng, SemiRing, LeftModule(%), unitsKnown) with characteristic
-> --  SemiRing == Join(SemiRng, AbelianMonoid, Monoid)
-> --  Rng      == Join(SemiRng, AbelianGroup) with
-> --   SemiRng == Join(AbelianSemiGroup, SemiGroup)
-> -- (i) Commutative group (over +)
-> Ring has AbelianGroup

   true
                                                                Type: Boolean
-> -- This property is provided by: Rng
-> -- (ii) Associativity (over *)
-> Ring has SemiGroup

   true
                                                                Type: Boolean
-> -- This property is provided by both
-> -- (iii) Multiplicative identity
-> Ring has Monoid

   true
                                                                Type: Boolean
-> -- This property is provided by: SemiRng
-> -- (iv) Distributivity
-> Ring has Rng

   true
                                                                Type: Boolean
-> -- This property is provided by: Rng

#+end_example

#+BEGIN_ASCII
This      Right rectangle is Rng
total   +----------------------+
is Ring |  AbelianGroup minus  |
        |    AbelianMonoid     |
+-------+-------------+        |
|       |AbelianMonoid|        |
|       +-------------+        |
|       |   SemiRng   |        |
|       +-------------+--------+
| Monoid              |
+---------------------+
Left rectangle is SemiRing
#+END_ASCII

#+BEGIN_SRC axiom
-- CommutativeRing == Join(Ring, BiModule(%, %), CommutativeStar)
CommutativeRing has Ring
CommutativeRing has CommutativeStar
#+END_SRC

#+RESULTS:
#+begin_example
-> -- CommutativeRing == Join(Ring, BiModule(%, %), CommutativeStar)
-> CommutativeRing has Ring

   true
                                                                Type: Boolean
-> CommutativeRing has CommutativeStar

   true
                                                                Type: Boolean

#+end_example

#+BEGIN_ASCII
NOTE BY ME:
There is a Category CharacteristicNonZero.
#+END_ASCII

*** Example 1.1.3 Ring
#+BEGIN_SRC axiom
SquareMatrix(2, FRAC INT) has Ring

SquareMatrix(2, FRAC INT) has CommutativeRing

characteristic()$SquareMatrix(2, FRAC INT)
#+END_SRC

#+RESULTS:
#+begin_example
-> SquareMatrix(2, FRAC INT) has Ring

   true
                                                                Type: Boolean
-> SquareMatrix(2, FRAC INT) has CommutativeRing

   false
                                                                Type: Boolean
-> characteristic()$SquareMatrix(2, FRAC INT)

   0
                                                     Type: NonNegativeInteger

#+end_example

*** Example 1.1.4 CommutativeRing
#+BEGIN_SRC axiom
R ==> IntegerMod 6
R has CommutativeRing

characteristic()$R

(2 * 3)$R
#+END_SRC

#+RESULTS:
#+begin_example
-> R ==> IntegerMod 6
                                                                   Type: Void
-> R has CommutativeRing

   true
                                                                Type: Boolean
-> characteristic()$R

   6
                                                     Type: NonNegativeInteger
-> (2 * 3)$R

   0
                                                          Type: IntegerMod(6)

#+end_example

#+BEGIN_SRC sh :results verbatim
cd ~/github/fricas
head -n 47 src/algebra/fmod.spad
#+END_SRC

#+RESULTS:
#+begin_example
)abbrev domain ZMOD IntegerMod
++ Author:
++ Date Created:
++ Date Last Updated:
++ Basic Functions:
++ Related Constructors:
++ Also See:
++ AMS Classifications:
++ Keywords:
++ References:
++ Description:
++ IntegerMod(n) creates the ring of integers reduced modulo the integer
++ n.

IntegerMod(p : PositiveInteger):
 Join(CommutativeRing, Finite, ConvertibleTo Integer, StepThrough) == add
  size()           == p
  characteristic() == p
  lookup x == (zero? x => p; (convert(x)@Integer) :: PositiveInteger)

-- Code is duplicated for the optimizer to kick in.
  if p <= convert(max()$SingleInteger)@Integer then
    Rep := SingleInteger
    q := p::SingleInteger

    bloodyCompiler : Integer -> %
    bloodyCompiler n == positiveRemainder(n, p)$Integer pretend %

    convert(x : %) : Integer == convert(x)$Rep
    coerce(x) : OutputForm == coerce(x)$Rep
    coerce(n : Integer) : %  == bloodyCompiler n
    0                    == 0$Rep
    1                    == 1$Rep
    init                 == 0$Rep
    nextItem(n)          ==
                              m := n+1
                              m = 0 => "failed"
                              m
    x = y                == x =$Rep y
    x : % * y : %            == mulmod(x, y, q)
    n : Integer * x : %      == mulmod(bloodyCompiler n, x, q)
    x + y                == addmod(x, y, q)
    x - y                == submod(x, y, q)
    random()             == random(q)$Rep
    index a              == positiveRemainder(a::%, q)
    - x                  == (zero? x => 0; q -$Rep x)

#+end_example

