symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org681484a" class="outline-4">
<h4 id="org681484a"><span class="section-number-4">3.1.4</span> Definition 1.1.2 Ring</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- Ring      == Join(Rng, SemiRing, LeftModule(%), unitsKnown) with characteristic</span>
<span style="color: #2aa1ae; background-color: #292e34;">--  SemiRing == Join(SemiRng, AbelianMonoid, Monoid)</span>
<span style="color: #2aa1ae; background-color: #292e34;">--  Rng      == Join(SemiRng, AbelianGroup) with</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   SemiRng == Join(AbelianSemiGroup, SemiGroup)</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (i) Commutative group (over +)</span>
<span style="color: #ce537a; font-weight: bold;">Ring</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">AbelianGroup</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- This property is provided by: Rng</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (ii) Associativity (over *)</span>
<span style="color: #ce537a; font-weight: bold;">Ring</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">SemiGroup</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- This property is provided by both</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (iii) Multiplicative identity</span>
<span style="color: #ce537a; font-weight: bold;">Ring</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Monoid</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- This property is provided by: SemiRng</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (iv) Distributivity</span>
<span style="color: #ce537a; font-weight: bold;">Ring</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Rng</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- This property is provided by: Rng</span>
</pre>
</div>

<pre class="example" id="orgcb15bbf">
-&gt; -- Ring      == Join(Rng, SemiRing, LeftModule(%), unitsKnown) with characteristic
-&gt; --  SemiRing == Join(SemiRng, AbelianMonoid, Monoid)
-&gt; --  Rng      == Join(SemiRng, AbelianGroup) with
-&gt; --   SemiRng == Join(AbelianSemiGroup, SemiGroup)
-&gt; -- (i) Commutative group (over +)
-&gt; Ring has AbelianGroup

   true
                                                                Type: Boolean
-&gt; -- This property is provided by: Rng
-&gt; -- (ii) Associativity (over *)
-&gt; Ring has SemiGroup

   true
                                                                Type: Boolean
-&gt; -- This property is provided by both
-&gt; -- (iii) Multiplicative identity
-&gt; Ring has Monoid

   true
                                                                Type: Boolean
-&gt; -- This property is provided by: SemiRng
-&gt; -- (iv) Distributivity
-&gt; Ring has Rng

   true
                                                                Type: Boolean
-&gt; -- This property is provided by: Rng

</pre>

<div class="ASCII" id="orgf7a6632">
<p>
This      Right rectangle is Rng
total   <del>----------------------</del>
is Ring |  AbelianGroup minus  |
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">AbelianMonoid</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>--------&#x2013;&#x2014;+        |
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">AbelianMonoid</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><del>-------------</del></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">SemiRng</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><del>-------------</del>---&#x2013;&#x2014;+</td>
</tr>

<tr>
<td class="org-left">Monoid</td>
</tr>
</tbody>
</table>
<p>
<del>---------------------</del>
Left rectangle is SemiRing
</p>

</div>

<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- CommutativeRing == Join(Ring, BiModule(%, %), CommutativeStar)</span>
<span style="color: #ce537a; font-weight: bold;">CommutativeRing</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Ring</span>
<span style="color: #ce537a; font-weight: bold;">CommutativeRing</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">CommutativeStar</span>
</pre>
</div>

<pre class="example" id="org0d8434c">
-&gt; -- CommutativeRing == Join(Ring, BiModule(%, %), CommutativeStar)
-&gt; CommutativeRing has Ring

   true
                                                                Type: Boolean
-&gt; CommutativeRing has CommutativeStar

   true
                                                                Type: Boolean

</pre>

<div class="ASCII" id="orge1829de">
<p>
NOTE BY ME:
There is a Category CharacteristicNonZero.
</p>

</div>
</div>
</div>

<div id="outline-container-org7a99d1f" class="outline-4">
<h4 id="org7a99d1f"><span class="section-number-4">3.1.5</span> Example 1.1.3 Ring</h4>
<div class="outline-text-4" id="text-3-1-5">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Ring</span>

<span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">CommutativeRing</span>

characteristic<span style="color: #4f97d7;">()</span>$<span style="color: #4f97d7;">SquareMatrix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgc465ae9">
-&gt; SquareMatrix(2, FRAC INT) has Ring

   true
                                                                Type: Boolean
-&gt; SquareMatrix(2, FRAC INT) has CommutativeRing

   false
                                                                Type: Boolean
-&gt; characteristic()$SquareMatrix(2, FRAC INT)

   0
                                                     Type: NonNegativeInteger

</pre>
</div>
</div>

<div id="outline-container-org0319771" class="outline-4">
<h4 id="org0319771"><span class="section-number-4">3.1.6</span> Example 1.1.4 CommutativeRing</h4>
<div class="outline-text-4" id="text-3-1-6">
<div class="org-src-container">
<pre class="src src-axiom">R ==&gt; <span style="color: #4f97d7;">IntegerMod</span> <span style="color: #a45bad;">6</span>
R <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">CommutativeRing</span>

characteristic<span style="color: #4f97d7;">()</span>$R

<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span> * <span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>$R
</pre>
</div>

<pre class="example" id="org8ec4392">
-&gt; R ==&gt; IntegerMod 6
                                                                   Type: Void
-&gt; R has CommutativeRing

   true
                                                                Type: Boolean
-&gt; characteristic()$R

   6
                                                     Type: NonNegativeInteger
-&gt; (2 * 3)$R

   0
                                                          Type: IntegerMod(6)

</pre>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> /fricas
head -n <span style="color: #a45bad;">47</span> src/algebra/fmod.spad
</pre>
</div>

<pre class="example" id="orgfbaf63e">
)abbrev domain ZMOD IntegerMod
++ Author:
++ Date Created:
++ Date Last Updated:
++ Basic Functions:
++ Related Constructors:
++ Also See:
++ AMS Classifications:
++ Keywords:
++ References:
++ Description:
++ IntegerMod(n) creates the ring of integers reduced modulo the integer
++ n.

IntegerMod(p : PositiveInteger):
 Join(CommutativeRing, Finite, ConvertibleTo Integer, StepThrough) == add
  size()           == p
  characteristic() == p
  lookup x == (zero? x =&gt; p; (convert(x)@Integer) :: PositiveInteger)

-- Code is duplicated for the optimizer to kick in.
  if p &lt;= convert(max()$SingleInteger)@Integer then
    Rep := SingleInteger
    q := p::SingleInteger

    bloodyCompiler : Integer -&gt; %
    bloodyCompiler n == positiveRemainder(n, p)$Integer pretend %

    convert(x : %) : Integer == convert(x)$Rep
    coerce(x) : OutputForm == coerce(x)$Rep
    coerce(n : Integer) : %  == bloodyCompiler n
    0                    == 0$Rep
    1                    == 1$Rep
    init                 == 0$Rep
    nextItem(n)          ==
                              m := n+1
                              m = 0 =&gt; "failed"
                              m
    x = y                == x =$Rep y
    x : % * y : %            == mulmod(x, y, q)
    n : Integer * x : %      == mulmod(bloodyCompiler n, x, q)
    x + y                == addmod(x, y, q)
    x - y                == submod(x, y, q)
    random()             == random(q)$Rep
    index a              == positiveRemainder(a::%, q)
    - x                  == (zero? x =&gt; 0; q -$Rep x)

</pre>
</div>
</div>
