symbolic-integration-1-transcendental-functions.org
*** Definition 1.1.3 IntegralDomain
#+BEGIN_SRC axiom
-- IntegralDomain == Join(CommutativeRing, Algebra(%), EntireRing)
IntegralDomain has CommutativeRing

IntegralDomain has noZeroDivisors
#+END_SRC

#+RESULTS:
#+begin_example
-> -- IntegralDomain == Join(CommutativeRing, Algebra(%), EntireRing)
-> IntegralDomain has CommutativeRing

   true
                                                                Type: Boolean
-> IntegralDomain has noZeroDivisors

   true
                                                                Type: Boolean

#+end_example

*** Example 1.1.5 IntegralDomain
#+BEGIN_SRC axiom
Complex Integer has IntegralDomain

S ==> SimpleAlgebraicExtension(INT, SUP INT, monomial(1,2)$SUP(INT)+5)
s:S := generator()$S

s^2

(1+s)*(1-s)

S has IntegralDomain
-- false -- how to fix?
S has CommutativeRing

S has noZeroDivisors
#+END_SRC

#+RESULTS:
#+begin_example
-> Complex Integer has IntegralDomain

   true
                                                                Type: Boolean
-> S ==> SimpleAlgebraicExtension(INT, SUP INT, monomial(1,2)$SUP(INT)+5)
                                                                    Type: Void
-> s:S := generator()$S

   ?
Type: SimpleAlgebraicExtension(Integer,SparseUnivariatePolynomial(Integer),?^2+5)
-> s^2

   - 5
Type: SimpleAlgebraicExtension(Integer,SparseUnivariatePolynomial(Integer),?^2+5)
-> (1+s)*(1-s)

   6
Type: SimpleAlgebraicExtension(Integer,SparseUnivariatePolynomial(Integer),?^2+5)
-> S has IntegralDomain

   false
                                                                Type: Boolean
-> -- false -- how to fix?
-> S has CommutativeRing

   true
                                                                Type: Boolean
-> S has noZeroDivisors

   false
                                                                Type: Boolean

#+end_example

#+BEGIN_SRC axiom
a | a^2+5=0

SAEa has IntegralDomain
-- There is
--   if R has Field and R has PolynomialFactorizationExplicit then PolynomialFactorizationExplicit
-- in the exports of SAE,
-- and FRAC INT has Field while INT does not.
#+END_SRC

#+RESULTS:
#+begin_example
-> a | a^2+5=0
   Your statement has resulted in the following assignments and
      declaration:

   SAEa := SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),a^2+5)
   a : SAEa := a

   a
Type: SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),a^2+5)
-> SAEa has IntegralDomain

   true
                                                                Type: Boolean
-> -- There is
-> --   if R has Field and R has PolynomialFactorizationExplicit then PolynomialFactorizationExplicit
-> -- in the exports of SAE,
-> -- and FRAC INT has Field while INT does not.

#+end_example

#+BEGIN_QUOTE
https://groups.google.com/d/topic/fricas-devel/vriGwv4weSI/discussion

In fact, it could be useful to allow boolean arguments in category
tests so user could supply extra argument saying that domain is a
field (or not).

ATM Spad compiler does not allow such tests.  More precisely, in
implementation part one can use arbitrary tests.  But export list
uses limited form of tests.
#+END_QUOTE

*** Definition 1.1.4 GcdDomain
#+BEGIN_SRC axiom :eval no
-- GcdDomain == Join(IntegralDomain, LeftOreRing) with gcd, lcm
-- GcdDomain ?has? gcd : (%, %) -> %
-- GcdDomain needs the property that gcd exists for any two non-zero elements,
-- which not all IntegralDomain satisfy, such as Example 1.1.6.
-- See also https://en.wikipedia.org/wiki/Greatest_common_divisor#The_gcd_in_commutative_rings
#+END_SRC

*** Example 1.1.6 GcdDomain
#+BEGIN_SRC axiom
SAE(INT, SUP INT, x^2+5) has GcdDomain
-- This is not the proof that SAE does not have GcdDomain.
#+END_SRC

#+RESULTS:
: -> SAE(INT, SUP INT, x^2+5) has GcdDomain
:
:    false
:                                                                 Type: Boolean
: -> -- This is not the proof that SAE does not have GcdDomain.
:

*** Definition 1.1.5 prime
#+BEGIN_SRC axiom :eval no
-- UniqueFactorizationDomain ?has? prime? : % -> Boolean
#+END_SRC

*** Example 1.1.7

*** Definition 1.1.6 UFD
#+BEGIN_SRC axiom
-- UniqueFactorizationDomain == GcdDomain with ...
UFD has IntegralDomain
-- prime?, squareFree, and factor is provided by UFD
#+END_SRC

#+RESULTS:
: -> -- UniqueFactorizationDomain == GcdDomain with ...
: -> UFD has IntegralDomain
:
:    true
:                                                                 Type: Boolean
: -> -- prime?, squareFree, and factor is provided by UFD
:

