symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org5f8940e" class="outline-4">
<h4 id="org5f8940e"><span class="section-number-4">3.1.7</span> Definition 1.1.3 IntegralDomain</h4>
<div class="outline-text-4" id="text-3-1-7">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- IntegralDomain == Join(CommutativeRing, Algebra(%), EntireRing)</span>
<span style="color: #ce537a; font-weight: bold;">IntegralDomain</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">CommutativeRing</span>

<span style="color: #ce537a; font-weight: bold;">IntegralDomain</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">noZeroDivisors</span>
</pre>
</div>

<pre class="example" id="org29b09f9">
-&gt; -- IntegralDomain == Join(CommutativeRing, Algebra(%), EntireRing)
-&gt; IntegralDomain has CommutativeRing

   true
                                                                Type: Boolean
-&gt; IntegralDomain has noZeroDivisors

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org47ad6f3" class="outline-4">
<h4 id="org47ad6f3"><span class="section-number-4">3.1.8</span> Example 1.1.5 IntegralDomain</h4>
<div class="outline-text-4" id="text-3-1-8">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">Complex</span> <span style="color: #4f97d7;">Integer</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">IntegralDomain</span>

S ==&gt; <span style="color: #4f97d7;">SimpleAlgebraicExtension</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">INT</span>, <span style="color: #4f97d7;">SUP</span> <span style="color: #4f97d7;">INT</span>, monomial<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>$<span style="color: #4f97d7;">SUP</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">INT</span><span style="color: #bc6ec5;">)</span>+<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
s:S := generator<span style="color: #4f97d7;">()</span>$S

s^<span style="color: #a45bad;">2</span>

<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>+s<span style="color: #4f97d7;">)</span>*<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>-s<span style="color: #4f97d7;">)</span>

S <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">IntegralDomain</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- false -- how to fix?</span>
S <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">CommutativeRing</span>

S <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">noZeroDivisors</span>
</pre>
</div>

<pre class="example" id="orgb7eaa07">
-&gt; Complex Integer has IntegralDomain

   true
                                                                Type: Boolean
-&gt; S ==&gt; SimpleAlgebraicExtension(INT, SUP INT, monomial(1,2)$SUP(INT)+5)
                                                                    Type: Void
-&gt; s:S := generator()$S

   ?
Type: SimpleAlgebraicExtension(Integer,SparseUnivariatePolynomial(Integer),?^2+5)
-&gt; s^2

   - 5
Type: SimpleAlgebraicExtension(Integer,SparseUnivariatePolynomial(Integer),?^2+5)
-&gt; (1+s)*(1-s)

   6
Type: SimpleAlgebraicExtension(Integer,SparseUnivariatePolynomial(Integer),?^2+5)
-&gt; S has IntegralDomain

   false
                                                                Type: Boolean
-&gt; -- false -- how to fix?
-&gt; S has CommutativeRing

   true
                                                                Type: Boolean
-&gt; S has noZeroDivisors

   false
                                                                Type: Boolean

</pre>

<div class="org-src-container">
<pre class="src src-axiom">a | a^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">5</span>=<span style="color: #a45bad;">0</span>

SAEa <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">IntegralDomain</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- There is</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   if R has Field and R has PolynomialFactorizationExplicit then PolynomialFactorizationExplicit</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- in the exports of SAE,</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- and FRAC INT has Field while INT does not.</span>
</pre>
</div>

<pre class="example" id="org4695447">
-&gt; a | a^2+5=0
   Your statement has resulted in the following assignments and
      declaration:

   SAEa := SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),a^2+5)
   a : SAEa := a

   a
Type: SimpleAlgebraicExtension(Fraction(Integer),UnivariatePolynomial(a,Fraction(Integer)),a^2+5)
-&gt; SAEa has IntegralDomain

   true
                                                                Type: Boolean
-&gt; -- There is
-&gt; --   if R has Field and R has PolynomialFactorizationExplicit then PolynomialFactorizationExplicit
-&gt; -- in the exports of SAE,
-&gt; -- and FRAC INT has Field while INT does not.

</pre>

<blockquote>
<p>
<a href="https://groups.google.com/d/topic/fricas-devel/vriGwv4weSI/discussion">https://groups.google.com/d/topic/fricas-devel/vriGwv4weSI/discussion</a>
</p>

<p>
In fact, it could be useful to allow boolean arguments in category
tests so user could supply extra argument saying that domain is a
field (or not).
</p>

<p>
ATM Spad compiler does not allow such tests.  More precisely, in
implementation part one can use arbitrary tests.  But export list
uses limited form of tests.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org4e5d7bc" class="outline-4">
<h4 id="org4e5d7bc"><span class="section-number-4">3.1.9</span> Definition 1.1.4 GcdDomain</h4>
<div class="outline-text-4" id="text-3-1-9">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- GcdDomain == Join(IntegralDomain, LeftOreRing) with gcd, lcm</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- GcdDomain ?has? gcd : (%, %) -&gt; %</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- GcdDomain needs the property that gcd exists for any two non-zero elements,</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- which not all IntegralDomain satisfy, such as Example 1.1.6.</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- See also https://en.wikipedia.org/wiki/Greatest_common_divisor#The_gcd_in_commutative_rings</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1e1846" class="outline-4">
<h4 id="orgf1e1846"><span class="section-number-4">3.1.10</span> Example 1.1.6 GcdDomain</h4>
<div class="outline-text-4" id="text-3-1-10">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">SAE</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">INT</span>, <span style="color: #4f97d7;">SUP</span> <span style="color: #4f97d7;">INT</span>, x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">GcdDomain</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- This is not the proof that SAE does not have GcdDomain.</span>
</pre>
</div>

<pre class="example">
-&gt; SAE(INT, SUP INT, x^2+5) has GcdDomain

   false
                                                                Type: Boolean
-&gt; -- This is not the proof that SAE does not have GcdDomain.

</pre>
</div>
</div>

<div id="outline-container-orge5ea859" class="outline-4">
<h4 id="orge5ea859"><span class="section-number-4">3.1.11</span> Definition 1.1.5 prime</h4>
<div class="outline-text-4" id="text-3-1-11">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- UniqueFactorizationDomain ?has? prime? : % -&gt; Boolean</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e36df3" class="outline-4">
<h4 id="org6e36df3"><span class="section-number-4">3.1.12</span> Example 1.1.7</h4>
</div>

<div id="outline-container-orgcc43d6f" class="outline-4">
<h4 id="orgcc43d6f"><span class="section-number-4">3.1.13</span> Definition 1.1.6 UFD</h4>
<div class="outline-text-4" id="text-3-1-13">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- UniqueFactorizationDomain == GcdDomain with ...</span>
<span style="color: #ce537a; font-weight: bold;">UFD</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">IntegralDomain</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- prime?, squareFree, and factor is provided by UFD</span>
</pre>
</div>

<pre class="example">
-&gt; -- UniqueFactorizationDomain == GcdDomain with ...
-&gt; UFD has IntegralDomain

   true
                                                                Type: Boolean
-&gt; -- prime?, squareFree, and factor is provided by UFD

</pre>
</div>
</div>
