symbolic-integration-1-transcendental-functions.org
*** Example 1.1.8 UFD
#+BEGIN_SRC axiom
MPOLY([u,v], FRAC INT) has UFD
#+END_SRC

#+RESULTS:
: -> MPOLY([u,v], FRAC INT) has UFD
:
:    true
:                                                                 Type: Boolean
:

#+BEGIN_ASCII
NOTES BY ME:
When the above code of Example 1.1.8 firstly written in 2014 Mrach 06,
it retuens false.

Then in 2014 September 07, SVN r1800,
"Activate PolynomialFactorizationExplicit for Integer",
And in PolynomialCategory there is:
    if R has PolynomialFactorizationExplicit then
       PolynomialFactorizationExplicit
in its definition, and "PFECAT has UFD".

Also see other discussion about PolynomialFactorizationExplicit
in FriCAS mail list.

An older discussion is:
https://groups.google.com/d/topic/fricas-devel/oEBpZYstIqo/discussion
#+END_ASCII

*** Theorem 1.1.3
#+BEGIN_SRC axiom
UFD has GcdDomain
#+END_SRC

#+RESULTS:
: -> UFD has GcdDomain
:
:    true
:                                                                 Type: Boolean
:

*** Theorem 1.1.4
#+BEGIN_SRC axiom
INT has UFD

MPOLY([x,y],INT) has UFD
-- Also see NOTES for Example 1.1.8
#+END_SRC

#+RESULTS:
#+begin_example
-> INT has UFD

   true
                                                                Type: Boolean
-> MPOLY([x,y],INT) has UFD

   true
                                                                Type: Boolean
-> -- Also see NOTES for Example 1.1.8

#+end_example

*** Definition 1.1.7 subgroup
*** Example 1.1.9 subgroup
*** Definition 1.1.8 Ideal
#+BEGIN_SRC axiom :eval no
-- PID ?has? principalIdeal: List % -> Record(coef : List %, generator : %)
#+END_SRC

*** Theorem 1.1.5
*** Example 1.1.10 principalIdeal
#+BEGIN_SRC axiom
MPOLY([x,y], FRAC INT) has PID
#+END_SRC

#+RESULTS:
: -> MPOLY([x,y], FRAC INT) has PID
:
:    false
:                                                                 Type: Boolean
:

*** Definition 1.1.9 PID
#+BEGIN_SRC axiom
-- PrincipalIdealDomain == GcdDomain with principalIdeal
PID has IntegralDomain
#+END_SRC

#+RESULTS:
: -> -- PrincipalIdealDomain == GcdDomain with principalIdeal
: -> PID has IntegralDomain
:
:    true
:                                                                 Type: Boolean
:

*** Example 1.1.11 PID
#+BEGIN_SRC axiom
POLY FRAC INT has PID

SUP FRAC INT has PID
#+END_SRC

#+RESULTS:
: -> POLY FRAC INT has PID
:
:    false
:                                                                 Type: Boolean
: -> SUP FRAC INT has PID
:
:    true
:                                                                 Type: Boolean
:

*** Definition 1.1.10 EuclideanDomain
#+BEGIN_SRC axiom
-- EuclideanDomain == PrincipalIdealDomain with divide, euclideanSize ...
-- (i) size function
-- EuclideanDomain ?has? euclideanSize : % -> NonNegativeInteger
-- (ii) Euclidean division
-- EuclideanDomain ?has? divide : (%, %) -> Record(quotient : %, remainder : %)
EuclideanDomain has IntegralDomain
#+END_SRC

#+RESULTS:
#+begin_example
-> -- EuclideanDomain == PrincipalIdealDomain with divide, euclideanSize ...
-> -- (i) size function
-> -- EuclideanDomain ?has? euclideanSize : % -> NonNegativeInteger
-> -- (ii) Euclidean division
-> -- EuclideanDomain ?has? divide : (%, %) -> Record(quotient : %, remainder : %)
-> EuclideanDomain has IntegralDomain

   true
                                                                Type: Boolean

#+end_example

*** Example 1.1.12 EuclideanDomain
#+BEGIN_SRC axiom
Integer has EuclideanDomain
-- euclideanSize implenmented under IntegerNumberSystem in si.spad
#+END_SRC

#+RESULTS:
: -> Integer has EuclideanDomain
:
:    true
:                                                                 Type: Boolean
: -> -- euclideanSize implenmented under IntegerNumberSystem in si.spad
:

*** Theorem 1.1.6
#+BEGIN_SRC axiom
EuclideanDomain has PID
#+END_SRC

#+RESULTS:
: -> EuclideanDomain has PID
:
:    true
:                                                                 Type: Boolean
:

*** Theorem 1.1.7
#+BEGIN_SRC axiom
PID has UFD
-- false -- why?
#+END_SRC

#+RESULTS:
: -> PID has UFD
:
:    false
:                                                                 Type: Boolean
: -> -- false -- why?
:

#+BEGIN_ASCII
NOTES BY ME:

See also https://groups.google.com/forum/?fromgroups=&hl=en#!topic/fricas-devel/mMmm9zmC7io
#+END_ASCII

