symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org12ca0b9" class="outline-4">
<h4 id="org12ca0b9"><span class="section-number-4">3.1.14</span> Example 1.1.8 UFD</h4>
<div class="outline-text-4" id="text-3-1-14">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">MPOLY</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>u,v<span style="color: #bc6ec5;">]</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">UFD</span>
</pre>
</div>

<pre class="example">
-&gt; MPOLY([u,v], FRAC INT) has UFD

   true
                                                                Type: Boolean

</pre>


<div class="ASCII" id="orga2f51be">
<p>
NOTES BY ME:
When the above code of Example 1.1.8 firstly written in 2014 Mrach 06,
it retuens false.
</p>

<p>
Then in 2014 September 07, SVN r1800,
"Activate PolynomialFactorizationExplicit for Integer",
And in PolynomialCategory there is:
    if R has PolynomialFactorizationExplicit then
       PolynomialFactorizationExplicit
in its definition, and "PFECAT has UFD".
</p>

<p>
Also see other discussion about PolynomialFactorizationExplicit
in FriCAS mail list.
</p>

<p>
An older discussion is:
<a href="https://groups.google.com/d/topic/fricas-devel/oEBpZYstIqo/discussion">https://groups.google.com/d/topic/fricas-devel/oEBpZYstIqo/discussion</a>
</p>

</div>
</div>
</div>

<div id="outline-container-org9ef92d4" class="outline-4">
<h4 id="org9ef92d4"><span class="section-number-4">3.1.15</span> Theorem 1.1.3</h4>
<div class="outline-text-4" id="text-3-1-15">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #ce537a; font-weight: bold;">UFD</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">GcdDomain</span>
</pre>
</div>

<pre class="example">
-&gt; UFD has GcdDomain

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org257940a" class="outline-4">
<h4 id="org257940a"><span class="section-number-4">3.1.16</span> Theorem 1.1.4</h4>
<div class="outline-text-4" id="text-3-1-16">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">UFD</span>

<span style="color: #4f97d7;">MPOLY</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>x,y<span style="color: #bc6ec5;">]</span>,<span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">UFD</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- Also see NOTES for Example 1.1.8</span>
</pre>
</div>

<pre class="example" id="orgbcf1712">
-&gt; INT has UFD

   true
                                                                Type: Boolean
-&gt; MPOLY([x,y],INT) has UFD

   true
                                                                Type: Boolean
-&gt; -- Also see NOTES for Example 1.1.8

</pre>
</div>
</div>

<div id="outline-container-org6937f7c" class="outline-4">
<h4 id="org6937f7c"><span class="section-number-4">3.1.17</span> Definition 1.1.7 subgroup</h4>
</div>
<div id="outline-container-orgd1898cb" class="outline-4">
<h4 id="orgd1898cb"><span class="section-number-4">3.1.18</span> Example 1.1.9 subgroup</h4>
</div>
<div id="outline-container-org0dd1c29" class="outline-4">
<h4 id="org0dd1c29"><span class="section-number-4">3.1.19</span> Definition 1.1.8 Ideal</h4>
<div class="outline-text-4" id="text-3-1-19">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- PID ?has? principalIdeal: List % -&gt; Record(coef : List %, generator : %)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb9cbd4" class="outline-4">
<h4 id="orgfb9cbd4"><span class="section-number-4">3.1.20</span> Theorem 1.1.5</h4>
</div>
<div id="outline-container-org179829a" class="outline-4">
<h4 id="org179829a"><span class="section-number-4">3.1.21</span> Example 1.1.10 principalIdeal</h4>
<div class="outline-text-4" id="text-3-1-21">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">MPOLY</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>x,y<span style="color: #bc6ec5;">]</span>, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">PID</span>
</pre>
</div>

<pre class="example">
-&gt; MPOLY([x,y], FRAC INT) has PID

   false
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org748d920" class="outline-4">
<h4 id="org748d920"><span class="section-number-4">3.1.22</span> Definition 1.1.9 PID</h4>
<div class="outline-text-4" id="text-3-1-22">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- PrincipalIdealDomain == GcdDomain with principalIdeal</span>
<span style="color: #ce537a; font-weight: bold;">PID</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">IntegralDomain</span>
</pre>
</div>

<pre class="example">
-&gt; -- PrincipalIdealDomain == GcdDomain with principalIdeal
-&gt; PID has IntegralDomain

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org00d651f" class="outline-4">
<h4 id="org00d651f"><span class="section-number-4">3.1.23</span> Example 1.1.11 PID</h4>
<div class="outline-text-4" id="text-3-1-23">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">PID</span>

<span style="color: #4f97d7;">SUP</span> <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">PID</span>
</pre>
</div>

<pre class="example">
-&gt; POLY FRAC INT has PID

   false
                                                                Type: Boolean
-&gt; SUP FRAC INT has PID

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org1e7ada0" class="outline-4">
<h4 id="org1e7ada0"><span class="section-number-4">3.1.24</span> Definition 1.1.10 EuclideanDomain</h4>
<div class="outline-text-4" id="text-3-1-24">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- EuclideanDomain == PrincipalIdealDomain with divide, euclideanSize ...</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (i) size function</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- EuclideanDomain ?has? euclideanSize : % -&gt; NonNegativeInteger</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (ii) Euclidean division</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- EuclideanDomain ?has? divide : (%, %) -&gt; Record(quotient : %, remainder : %)</span>
<span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">IntegralDomain</span>
</pre>
</div>

<pre class="example" id="orgcf3c713">
-&gt; -- EuclideanDomain == PrincipalIdealDomain with divide, euclideanSize ...
-&gt; -- (i) size function
-&gt; -- EuclideanDomain ?has? euclideanSize : % -&gt; NonNegativeInteger
-&gt; -- (ii) Euclidean division
-&gt; -- EuclideanDomain ?has? divide : (%, %) -&gt; Record(quotient : %, remainder : %)
-&gt; EuclideanDomain has IntegralDomain

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-orgeb7fc6d" class="outline-4">
<h4 id="orgeb7fc6d"><span class="section-number-4">3.1.25</span> Example 1.1.12 EuclideanDomain</h4>
<div class="outline-text-4" id="text-3-1-25">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">Integer</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- euclideanSize implenmented under IntegerNumberSystem in si.spad</span>
</pre>
</div>

<pre class="example">
-&gt; Integer has EuclideanDomain

   true
                                                                Type: Boolean
-&gt; -- euclideanSize implenmented under IntegerNumberSystem in si.spad

</pre>
</div>
</div>

<div id="outline-container-orgab9e526" class="outline-4">
<h4 id="orgab9e526"><span class="section-number-4">3.1.26</span> Theorem 1.1.6</h4>
<div class="outline-text-4" id="text-3-1-26">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">PID</span>
</pre>
</div>

<pre class="example">
-&gt; EuclideanDomain has PID

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org0048568" class="outline-4">
<h4 id="org0048568"><span class="section-number-4">3.1.27</span> Theorem 1.1.7</h4>
<div class="outline-text-4" id="text-3-1-27">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #ce537a; font-weight: bold;">PID</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">UFD</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- false -- why?</span>
</pre>
</div>

<pre class="example">
-&gt; PID has UFD

   false
                                                                Type: Boolean
-&gt; -- false -- why?

</pre>


<div class="ASCII" id="orgde5b296">
<p>
NOTES BY ME:
</p>

<p>
See also <a href="https://groups.google.com/forum/?fromgroups=&amp;hl=en#!topic/fricas-devel/mMmm9zmC7io">https://groups.google.com/forum/?fromgroups=&amp;hl=en#!topic/fricas-devel/mMmm9zmC7io</a>
</p>

</div>
</div>
</div>
