symbolic-integration-1-transcendental-functions.org
*** Definition 1.1.11 Field
#+BEGIN_SRC axiom
-- Field == Join(EuclideanDomain, UniqueFactorizationDomain,
--               DivisionRing, canonicalUnitNormal, canonicalsClosed) with /
--   DivisionRing == Join(EntireRing, Algebra Fraction Integer) with inv
Field has CommutativeRing

Field has DivisionRing
-- See comments form DivisionRing's definition:
--   A division ring (sometimes called a skew field),
--   i.e. a not necessarily commutative ring where
--   all non-zero elements have multiplicative inverses.
#+END_SRC

#+RESULTS:
#+begin_example
-> -- Field == Join(EuclideanDomain, UniqueFactorizationDomain,
-> --               DivisionRing, canonicalUnitNormal, canonicalsClosed) with /
-> --   DivisionRing == Join(EntireRing, Algebra Fraction Integer) with inv
-> Field has CommutativeRing

   true
                                                                Type: Boolean
-> Field has DivisionRing

   true
                                                                Type: Boolean
-> -- See comments form DivisionRing's definition:
-> --   A division ring (sometimes called a skew field),
-> --   i.e. a not necessarily commutative ring where
-> --   all non-zero elements have multiplicative inverses.

#+end_example

*** Example 1.1.13 Field
#+BEGIN_SRC axiom
IntegerMod 5 has Field

PrimeField 5 has Field
#+END_SRC

#+RESULTS:
: -> IntegerMod 5 has Field
:
:    false
:                                                                 Type: Boolean
: -> PrimeField 5 has Field
:
:    true
:                                                                 Type: Boolean
:

*** Example 1.1.14 Field
#+BEGIN_SRC axiom
FRAC INT has Field

FRAC POLY INT has Field

POLY FRAC INT has Field
-- Fraction(S : IntegralDomain) : QuotientFieldCategory S with ...
-- QuotientFieldCategory(S : IntegralDomain) : Category == Join(Field, ...
#+END_SRC

#+RESULTS:
#+begin_example
-> FRAC INT has Field

   true
                                                                Type: Boolean
-> FRAC POLY INT has Field

   true
                                                                Type: Boolean
-> POLY FRAC INT has Field

   false
                                                                Type: Boolean
-> -- Fraction(S : IntegralDomain) : QuotientFieldCategory S with ...
-> -- QuotientFieldCategory(S : IntegralDomain) : Category == Join(Field, ...

#+end_example

*** Definition 1.1.12 SimpleAlgebraicExtension
#+BEGIN_ASCII
NOTES BY ME:

SAE in FriCAS is not exactly the same with Definition 1.1.12.
SAE(INT, SUP INT, x^2+5) has Field -- false
#+END_ASCII

*** Definition 1.1.13 AlgebraicallyClosedField
#+BEGIN_SRC axiom
AlgebraicallyClosedField has Field
-- AlgebraicallyClosedField == Join(Field, RadicalCategory) with ...
#+END_SRC

#+RESULTS:
: -> AlgebraicallyClosedField has Field
:
:    true
:                                                                 Type: Boolean
: -> -- AlgebraicallyClosedField == Join(Field, RadicalCategory) with ...
:

*** Theorem 1.1.9
*** Theorem 1.1.10
*** Theorem 1.1.11

** 1.2 Euclidean Division and Pseudo-Division
*** Algorithm: PolyDivide
[[~/github/fricas/src/algebra/polycat.spad::852]]

#+BEGIN_EXAMPLE
-- UnivariatePolynomialCategory(R)
    if R has Field then
        EuclideanDomain
#+END_EXAMPLE

[[~/github/fricas/src/algebra/poly.spad::883]]

#+begin_example
-- SparseUnivariatePolynomial(R)
--   : UnivariatePolynomialCategory(R) with ...
   if R has Field then
     divide(p1, p2)  ==
       zero? p2 => error "Division by 0"
       (p2 = 1) => [p1, 0]
       ct := inv(p2.first.c)
       n := p2.first.k
       p2 := p2.rest
       rout := empty()$List(Term)
       while p1 ~= 0 repeat
          (u := subtractIfCan(p1.first.k, n)) case "failed" => break
          rout := cons([u, ct * p1.first.c], rout)
          p1 := fmecg(p1.rest, rout.first.k, rout.first.c, p2)
       [reverse!(rout), p1]
#+end_example

Rewrite using notations from book:

#+BEGIN_ASCII
  pseudo code: A  B  Q    R  delta T
  spad code  : p1 p2 rout p1 u     rout.first
Notice that "p2 := p2.rest" part, together with "fmecg(p1.rest, ...)",
to reduce computation.
#+END_ASCII

#+BEGIN_SRC spad :eval no
divide(A, B)  ==
  zero? B => error "Division by 0"
  (B = 1) => [A, 0]
  Q := empty()$List(Term)
  R := A
  lcR := R.first.c
  lcB := B.first.c
  degR := R.first.k
  degB := B.first.k
  B := B.rest -- speed hack: use R.rest in fmecg bellow
  while R ~= 0 repeat
     (delta := subtractIfCan(degR, degB)) case "failed" => break
     T := [delta, lcR/lcB]
     Q := cons(T, Q)
     R := fmecg(R.rest, T.k, T.c, B) -- R - B * T
  [reverse!(Q), R]
#+END_SRC

