symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org1d90403" class="outline-4">
<h4 id="org1d90403"><span class="section-number-4">3.1.28</span> Definition 1.1.11 Field</h4>
<div class="outline-text-4" id="text-3-1-28">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- Field == Join(EuclideanDomain, UniqueFactorizationDomain,</span>
<span style="color: #2aa1ae; background-color: #292e34;">--               DivisionRing, canonicalUnitNormal, canonicalsClosed) with /</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   DivisionRing == Join(EntireRing, Algebra Fraction Integer) with inv</span>
<span style="color: #ce537a; font-weight: bold;">Field</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">CommutativeRing</span>

<span style="color: #ce537a; font-weight: bold;">Field</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">DivisionRing</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- See comments form DivisionRing's definition:</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   A division ring (sometimes called a skew field),</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   i.e. a not necessarily commutative ring where</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   all non-zero elements have multiplicative inverses.</span>
</pre>
</div>

<pre class="example" id="orgc0c23ba">
-&gt; -- Field == Join(EuclideanDomain, UniqueFactorizationDomain,
-&gt; --               DivisionRing, canonicalUnitNormal, canonicalsClosed) with /
-&gt; --   DivisionRing == Join(EntireRing, Algebra Fraction Integer) with inv
-&gt; Field has CommutativeRing

   true
                                                                Type: Boolean
-&gt; Field has DivisionRing

   true
                                                                Type: Boolean
-&gt; -- See comments form DivisionRing's definition:
-&gt; --   A division ring (sometimes called a skew field),
-&gt; --   i.e. a not necessarily commutative ring where
-&gt; --   all non-zero elements have multiplicative inverses.

</pre>
</div>
</div>

<div id="outline-container-org4a11e9e" class="outline-4">
<h4 id="org4a11e9e"><span class="section-number-4">3.1.29</span> Example 1.1.13 Field</h4>
<div class="outline-text-4" id="text-3-1-29">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">IntegerMod</span> <span style="color: #a45bad;">5</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>

<span style="color: #4f97d7;">PrimeField</span> <span style="color: #a45bad;">5</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>
</pre>
</div>

<pre class="example">
-&gt; IntegerMod 5 has Field

   false
                                                                Type: Boolean
-&gt; PrimeField 5 has Field

   true
                                                                Type: Boolean

</pre>
</div>
</div>

<div id="outline-container-org0441635" class="outline-4">
<h4 id="org0441635"><span class="section-number-4">3.1.30</span> Example 1.1.14 Field</h4>
<div class="outline-text-4" id="text-3-1-30">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>

<span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>

<span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- Fraction(S : IntegralDomain) : QuotientFieldCategory S with ...</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- QuotientFieldCategory(S : IntegralDomain) : Category == Join(Field, ...</span>
</pre>
</div>

<pre class="example" id="org350f527">
-&gt; FRAC INT has Field

   true
                                                                Type: Boolean
-&gt; FRAC POLY INT has Field

   true
                                                                Type: Boolean
-&gt; POLY FRAC INT has Field

   false
                                                                Type: Boolean
-&gt; -- Fraction(S : IntegralDomain) : QuotientFieldCategory S with ...
-&gt; -- QuotientFieldCategory(S : IntegralDomain) : Category == Join(Field, ...

</pre>
</div>
</div>

<div id="outline-container-org775f799" class="outline-4">
<h4 id="org775f799"><span class="section-number-4">3.1.31</span> Definition 1.1.12 SimpleAlgebraicExtension</h4>
<div class="outline-text-4" id="text-3-1-31">
<div class="ASCII" id="org97bb919">
<p>
NOTES BY ME:
</p>

<p>
SAE in FriCAS is not exactly the same with Definition 1.1.12.
SAE(INT, SUP INT, x<sup>2</sup>+5) has Field &#x2013; false
</p>

</div>
</div>
</div>

<div id="outline-container-orgf0fd717" class="outline-4">
<h4 id="orgf0fd717"><span class="section-number-4">3.1.32</span> Definition 1.1.13 AlgebraicallyClosedField</h4>
<div class="outline-text-4" id="text-3-1-32">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #ce537a; font-weight: bold;">AlgebraicallyClosedField</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- AlgebraicallyClosedField == Join(Field, RadicalCategory) with ...</span>
</pre>
</div>

<pre class="example">
-&gt; AlgebraicallyClosedField has Field

   true
                                                                Type: Boolean
-&gt; -- AlgebraicallyClosedField == Join(Field, RadicalCategory) with ...

</pre>
</div>
</div>

<div id="outline-container-org6875358" class="outline-4">
<h4 id="org6875358"><span class="section-number-4">3.1.33</span> Theorem 1.1.9</h4>
</div>
<div id="outline-container-org83a5cb9" class="outline-4">
<h4 id="org83a5cb9"><span class="section-number-4">3.1.34</span> Theorem 1.1.10</h4>
</div>
<div id="outline-container-orgfc189ed" class="outline-4">
<h4 id="orgfc189ed"><span class="section-number-4">3.1.35</span> Theorem 1.1.11</h4>
</div>
</div>

<div id="outline-container-org8b7577f" class="outline-3">
<h3 id="org8b7577f"><span class="section-number-3">3.2</span> 1.2 Euclidean Division and Pseudo-Division</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org589a64e" class="outline-4">
<h4 id="org589a64e"><span class="section-number-4">3.2.1</span> Algorithm: PolyDivide</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
<a href="file:///fricas/src/algebra/polycat.spad">file:///fricas/src/algebra/polycat.spad</a> 853
</p>

<pre class="example" id="org26dfbe6">
-- UnivariatePolynomialCategory(R)
    if R has Field then
        EuclideanDomain
</pre>

<p>
<a href="file:///fricas/src/algebra/poly.spad">file:///fricas/src/algebra/poly.spad</a> 883
</p>

<pre class="example" id="org25422e6">
-- SparseUnivariatePolynomial(R)
--   : UnivariatePolynomialCategory(R) with ...
   if R has Field then
     divide(p1, p2)  ==
       zero? p2 =&gt; error "Division by 0"
       (p2 = 1) =&gt; [p1, 0]
       ct := inv(p2.first.c)
       n := p2.first.k
       p2 := p2.rest
       rout := empty()$List(Term)
       while p1 ~= 0 repeat
          (u := subtractIfCan(p1.first.k, n)) case "failed" =&gt; break
          rout := cons([u, ct * p1.first.c], rout)
          p1 := fmecg(p1.rest, rout.first.k, rout.first.c, p2)
       [reverse!(rout), p1]
</pre>

<p>
Rewrite using notations from book:
</p>

<div class="ASCII" id="orgdfbf929">
<p>
  pseudo code: A  B  Q    R  delta T
  spad code  : p1 p2 rout p1 u     rout.first
Notice that "p2 := p2.rest" part, together with "fmecg(p1.rest, &#x2026;)",
to reduce computation.
</p>

</div>

<div class="org-src-container">
<pre class="src src-spad">divide<span style="color: #4f97d7;">(</span>A, B<span style="color: #4f97d7;">)</span>  ==
  zero? B =&gt; error <span style="color: #2d9574;">"Division by 0"</span>
  <span style="color: #4f97d7;">(</span>B = <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span> =&gt; <span style="color: #4f97d7;">[</span>A, <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>
  Q := empty<span style="color: #4f97d7;">()</span>$<span style="color: #4f97d7;">List</span><span style="color: #4f97d7;">(</span>Term<span style="color: #4f97d7;">)</span>
  R := A
  lcR := R.first.c
  lcB := B.first.c
  degR := R.first.k
  degB := B.first.k
  B := B.rest <span style="color: #2aa1ae; background-color: #292e34;">-- speed hack: use R.rest in fmecg bellow</span>
  <span style="color: #4f97d7; font-weight: bold;">while</span> R ~= <span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">repeat</span>
     <span style="color: #4f97d7;">(</span>delta := subtractIfCan<span style="color: #bc6ec5;">(</span>degR, degB<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> case <span style="color: #2d9574;">"failed"</span> =&gt; <span style="color: #4f97d7; font-weight: bold;">break</span>
     T := <span style="color: #4f97d7;">[</span>delta, lcR/lcB<span style="color: #4f97d7;">]</span>
     Q := cons<span style="color: #4f97d7;">(</span>T, Q<span style="color: #4f97d7;">)</span>
     R := fmecg<span style="color: #4f97d7;">(</span>R.rest, T.k, T.c, B<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">-- R - B * T</span>
  <span style="color: #4f97d7;">[</span>reverse!<span style="color: #bc6ec5;">(</span>Q<span style="color: #bc6ec5;">)</span>, R<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
