symbolic-integration-1-transcendental-functions.org
*** Example 1.2.1 PolyDivide
#+BEGIN_SRC axiom
)clear all
T ==> UP(x, FRAC INT);
T has EUCDOM

A := 3*x^3 + x^2 + x + 5
B := 5*x^2 - 3*x + 1
divide(A, B)$T
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> T ==> UP(x, FRAC INT);
                                                                    Type: Void
-> T has EUCDOM

   true
                                                                Type: Boolean
-> A := 3*x^3 + x^2 + x + 5

      3    2
   3 x  + x  + x + 5
                                                    Type: Polynomial(Integer)
-> B := 5*x^2 - 3*x + 1

      2
   5 x  - 3 x + 1
                                                    Type: Polynomial(Integer)
-> divide(A, B)$T

               3     14              52     111
   [quotient = ─ x + ──, remainder = ── x + ───]
               5     25              25      25
Type: Record(quotient: UnivariatePolynomial(x,Fraction(Integer)),remainder: UnivariatePolynomial(x,Fraction(Integer)))

#+end_example

*** Algorithm: PolyPseudoDivide
#+BEGIN_SRC axiom
FRAC INT has Field
T ==> UP(x, FRAC INT)
T has divide : (T, T) -> Record(quotient:T, remainder:T)

INT has Field
T ==> UP(x, INT)
T has divide : (T, T) -> Record(quotient:T, remainder:T)
T has pseudoDivide : (T, T) -> Record(coef:Integer, quotient:T, remainder:T)
#+END_SRC

#+RESULTS:
#+begin_example
-> FRAC INT has Field

   true
                                                                Type: Boolean
-> T ==> UP(x, FRAC INT)
                                                                    Type: Void
-> T has divide : (T, T) -> Record(quotient:T, remainder:T)

   true
                                                                Type: Boolean
-> INT has Field

   false
                                                                Type: Boolean
-> T ==> UP(x, INT)
                                                                    Type: Void
-> T has divide : (T, T) -> Record(quotient:T, remainder:T)

   false
                                                                Type: Boolean
-> T has pseudoDivide : (T, T) -> Record(coef:Integer, quotient:T, remainder:T)

   true
                                                                Type: Boolean

#+end_example

[[~/github/fricas/src/algebra/polycat.spad::844]]

#+BEGIN_EXAMPLE
-- UnivariatePolynomialCategory(R)
    if R has IntegralDomain then
        pseudoDivide : (%, %) -> Record(coef : R, quotient : %, remainder : %)
#+END_EXAMPLE

[[~/github/fricas/src/algebra/polycat.spad::1059][implementation of pseudoDivide]]

[[~/github/fricas/src/algebra/polycat.spad::1026][implementation of pseudoRemainder]]

*** Example 1.2.2 PolyPseudoDivide
#+BEGIN_SRC axiom
pseudoDivide(A, B)
#+END_SRC

#+RESULTS:
: -> pseudoDivide(A, B)
:
:    [coef = 25,quotient = 15x + 14,remainder = 52x + 111]
: Type: Record(coef: Integer,quotient: UnivariatePolynomial(x,Integer),remainder: UnivariatePolynomial(x,Integer))
:

** 1.3 The Euclidean Algorithm
#+BEGIN_SRC axiom
POLY INT has EuclideanDomain
POLY INT has GcdDomain
UP(x, INT) has EuclideanDomain
UP(x, INT) has GcdDomain

POLY FRAC INT has EuclideanDomain
POLY FRAC INT has GcdDomain
UP(x, FRAC INT) has EuclideanDomain
UP(x, FRAC INT) has GcdDomain
#+END_SRC

#+RESULTS:
#+begin_example
-> POLY INT has EuclideanDomain

   false
                                                                Type: Boolean
-> POLY INT has GcdDomain

   true
                                                                Type: Boolean
-> UP(x, INT) has EuclideanDomain

   false
                                                                Type: Boolean
-> UP(x, INT) has GcdDomain

   true
                                                                Type: Boolean
-> POLY FRAC INT has EuclideanDomain

   false
                                                                Type: Boolean
-> POLY FRAC INT has GcdDomain

   true
                                                                Type: Boolean
-> UP(x, FRAC INT) has EuclideanDomain

   true
                                                                Type: Boolean
-> UP(x, FRAC INT) has GcdDomain

   true
                                                                Type: Boolean

#+end_example

