symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org2cc0e3d" class="outline-4">
<h4 id="org2cc0e3d"><span class="section-number-4">3.2.2</span> Example 1.2.1 PolyDivide</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #e0211d; text-decoration: overline;">)</span>clear all
T ==&gt; <span style="color: #4f97d7;">UP</span><span style="color: #e0211d; text-decoration: overline;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #e0211d; text-decoration: overline;">)</span>;
T <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">EUCDOM</span>

A := <span style="color: #a45bad;">3</span>*x^<span style="color: #a45bad;">3</span> + x^<span style="color: #a45bad;">2</span> + x + <span style="color: #a45bad;">5</span>
B := <span style="color: #a45bad;">5</span>*x^<span style="color: #a45bad;">2</span> - <span style="color: #a45bad;">3</span>*x + <span style="color: #a45bad;">1</span>
divide<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>$T
</pre>
</div>

<pre class="example" id="org4143899">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; T ==&gt; UP(x, FRAC INT);
                                                                    Type: Void
-&gt; T has EUCDOM

   true
                                                                Type: Boolean
-&gt; A := 3*x^3 + x^2 + x + 5

      3    2
   3 x  + x  + x + 5
                                                    Type: Polynomial(Integer)
-&gt; B := 5*x^2 - 3*x + 1

      2
   5 x  - 3 x + 1
                                                    Type: Polynomial(Integer)
-&gt; divide(A, B)$T

               3     14              52     111
   [quotient = ─ x + ──, remainder = ── x + ───]
               5     25              25      25
Type: Record(quotient: UnivariatePolynomial(x,Fraction(Integer)),remainder: UnivariatePolynomial(x,Fraction(Integer)))

</pre>
</div>
</div>

<div id="outline-container-org749dc38" class="outline-4">
<h4 id="org749dc38"><span class="section-number-4">3.2.3</span> Algorithm: PolyPseudoDivide</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>
T ==&gt; <span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
T <span style="color: #4f97d7; font-weight: bold;">has</span> divide : <span style="color: #4f97d7;">(</span>T, T<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Record</span><span style="color: #4f97d7;">(</span>quotient:T, remainder:T<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Field</span>
T ==&gt; <span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
T <span style="color: #4f97d7; font-weight: bold;">has</span> divide : <span style="color: #4f97d7;">(</span>T, T<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Record</span><span style="color: #4f97d7;">(</span>quotient:T, remainder:T<span style="color: #4f97d7;">)</span>
T <span style="color: #4f97d7; font-weight: bold;">has</span> pseudoDivide : <span style="color: #4f97d7;">(</span>T, T<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Record</span><span style="color: #4f97d7;">(</span>coef:<span style="color: #4f97d7;">Integer</span>, quotient:T, remainder:T<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org69adb3b">
-&gt; FRAC INT has Field

   true
                                                                Type: Boolean
-&gt; T ==&gt; UP(x, FRAC INT)
                                                                    Type: Void
-&gt; T has divide : (T, T) -&gt; Record(quotient:T, remainder:T)

   true
                                                                Type: Boolean
-&gt; INT has Field

   false
                                                                Type: Boolean
-&gt; T ==&gt; UP(x, INT)
                                                                    Type: Void
-&gt; T has divide : (T, T) -&gt; Record(quotient:T, remainder:T)

   false
                                                                Type: Boolean
-&gt; T has pseudoDivide : (T, T) -&gt; Record(coef:Integer, quotient:T, remainder:T)

   true
                                                                Type: Boolean

</pre>

<p>
<a href="file:///fricas/src/algebra/polycat.spad">file:///fricas/src/algebra/polycat.spad</a> 844
</p>

<pre class="example" id="orgad367c6">
-- UnivariatePolynomialCategory(R)
    if R has IntegralDomain then
        pseudoDivide : (%, %) -&gt; Record(coef : R, quotient : %, remainder : %)
</pre>

<p>
<a href="file:///fricas/src/algebra/polycat.spad">implementation of pseudoDivide</a> 1059
</p>

<p>
<a href="file:///fricas/src/algebra/polycat.spad">implementation of pseudoRemainder</a> 1026
</p>
</div>
</div>

<div id="outline-container-orgacb0a84" class="outline-4">
<h4 id="orgacb0a84"><span class="section-number-4">3.2.4</span> Example 1.2.2 PolyPseudoDivide</h4>
<div class="outline-text-4" id="text-3-2-4">
<div class="org-src-container">
<pre class="src src-axiom">pseudoDivide<span style="color: #4f97d7;">(</span>A, B<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; pseudoDivide(A, B)

   [coef = 25,quotient = 15x + 14,remainder = 52x + 111]
Type: Record(coef: Integer,quotient: UnivariatePolynomial(x,Integer),remainder: UnivariatePolynomial(x,Integer))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc713274" class="outline-3">
<h3 id="orgc713274"><span class="section-number-3">3.3</span> 1.3 The Euclidean Algorithm</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span>
<span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">GcdDomain</span>
<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span>
<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">GcdDomain</span>

<span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span>
<span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">GcdDomain</span>
<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">EuclideanDomain</span>
<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">GcdDomain</span>
</pre>
</div>

<pre class="example" id="org018b1da">
-&gt; POLY INT has EuclideanDomain

   false
                                                                Type: Boolean
-&gt; POLY INT has GcdDomain

   true
                                                                Type: Boolean
-&gt; UP(x, INT) has EuclideanDomain

   false
                                                                Type: Boolean
-&gt; UP(x, INT) has GcdDomain

   true
                                                                Type: Boolean
-&gt; POLY FRAC INT has EuclideanDomain

   false
                                                                Type: Boolean
-&gt; POLY FRAC INT has GcdDomain

   true
                                                                Type: Boolean
-&gt; UP(x, FRAC INT) has EuclideanDomain

   true
                                                                Type: Boolean
-&gt; UP(x, FRAC INT) has GcdDomain

   true
                                                                Type: Boolean

</pre>
</div>
