symbolic-integration-1-transcendental-functions.org
*** Example 1.3.1 EuclideanDivision
#+BEGIN_SRC axiom
a := x^4 - 2*x^3 - 6*x^2 + 12*x + 15;
b := x^3 + x^2 - 4*x - 4;
gcd(a, b)
gcd(a, b)$UP(x, FRAC INT)
#+END_SRC

#+RESULTS:
#+begin_example
-> a := x^4 - 2*x^3 - 6*x^2 + 12*x + 15;

                                                    Type: Polynomial(Integer)
-> b := x^3 + x^2 - 4*x - 4;

                                                    Type: Polynomial(Integer)
-> gcd(a, b)

   x + 1
                                                    Type: Polynomial(Integer)
-> gcd(a, b)$UP(x, FRAC INT)

   x + 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))

#+end_example

#+BEGIN_EXAMPLE
gcd, like divide in last section, is also implemented in SUP in
poly.spad :
#+END_EXAMPLE

#+BEGIN_SRC sh :results verbatim
cd ~/github/fricas
grep 'gcd(p1, p2)' src/algebra/poly.spad -A3
#+END_SRC

#+RESULTS:
:      gcd(p1, p2) ==
:           gcdPolynomial(p1 pretend SparseUnivariatePolynomial R,
:                         p2 pretend SparseUnivariatePolynomial R) pretend %
:

#+BEGIN_EXAMPLE
TODO: NOTE:

add source code for ExtendedEuclidean

it's implemented in catdef.spad, EUCDOM, seems very very inefficient?
#+END_EXAMPLE

*** Example 1.3.2 ExtendedEuclidean
#+BEGIN_SRC axiom
extendedEuclidean(a, b, 5*x+5)$UP(x, FRAC INT)
#+END_SRC

#+RESULTS:
: -> extendedEuclidean(a, b, 5*x+5)$UP(x, FRAC INT)
:
:                              2
:    [coef1 = - x + 3,coef2 = x  - 6x + 10]
: Type: Union(Record(coef1: UnivariatePolynomial(x,Fraction(Integer)),coef2: UnivariatePolynomial(x,Fraction(Integer))),...)
:

*** Example 1.3.3
*** Example 1.3.4
#+BEGIN_SRC axiom
stg := extendedEuclidean(a, b)$UP(x, FRAC INT)

s := stg.coef1
t := stg.coef2
g := stg.generator
qr:= divide(x^2-1,g)

q := qr.quotient
r := qr.remainder
s := q*s

t := q*t

s*a+t*b = x^2-1
#+END_SRC

#+RESULTS:
#+begin_example
-> stg := extendedEuclidean(a, b)$UP(x, FRAC INT)

              1     3         1  2   6
   [coef1 = - ─ x + ─,coef2 = ─ x  - ─ x + 2,generator = x + 1]
              5     5         5      5
Type: Record(coef1: UnivariatePolynomial(x,Fraction(Integer)),coef2: UnivariatePolynomial(x,Fraction(Integer)),generator: UnivariatePolynomial(x,Fraction(Integer)))
-> s := stg.coef1

     1     3
   - ─ x + ─
     5     5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> t := stg.coef2

   1  2   6
   ─ x  - ─ x + 2
   5      5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> g := stg.generator

   x + 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> qr:= divide(x^2-1,g)

   [quotient = x - 1,remainder = 0]
Type: Record(quotient: UnivariatePolynomial(x,Fraction(Integer)),remainder: UnivariatePolynomial(x,Fraction(Integer)))
-> q := qr.quotient

   x - 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> r := qr.remainder

   0
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> s := q*s

     1  2   4     3
   - ─ x  + ─ x - ─
     5      5     5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> t := q*t

   1  3   7  2   16
   ─ x  - ─ x  + ── x - 2
   5      5       5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> s*a+t*b = x^2-1

    2        2
   x  - 1 = x  - 1
                                Type: Equation(Polynomial(Fraction(Integer)))

#+end_example

*** Example 1.3.5
#+BEGIN_SRC axiom
extendedEuclidean(a, b, x^2-1)$UP(x, FRAC INT)
#+END_SRC

#+RESULTS:
: -> extendedEuclidean(a, b, x^2-1)$UP(x, FRAC INT)
:
:               1  2   4     3         1  3   7  2   16
:    [coef1 = - ─ x  + ─ x - ─,coef2 = ─ x  - ─ x  + ── x - 2]
:               5      5     5         5      5       5
: Type: Union(Record(coef1: UnivariatePolynomial(x,Fraction(Integer)),coef2: UnivariatePolynomial(x,Fraction(Integer))),...)
:

#+BEGIN_ASCII
NOTES by me:

How to use dioSolve to solve this equation?
#+END_ASCII

*** Example 1.3.6 PartialFraction
#+BEGIN_SRC axiom
x := monomial(1, 1)$SUP FRAC INT;
f := (x^2+3*x)/(x^3-x^2-x+1);
partialFraction f
#+END_SRC

#+RESULTS:
#+begin_example
-> x := monomial(1, 1)$SUP FRAC INT;

                          Type: SparseUnivariatePolynomial(Fraction(Integer))
-> f := (x^2+3*x)/(x^3-x^2-x+1);

                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-> partialFraction f

    3     1     1
    ─ ? + ─     ─
    2     2     2
   ──────── - ─────
          2   ? + 1
   (? - 1)
         Type: PartialFraction(SparseUnivariatePolynomial(Fraction(Integer)))

#+end_example

#+BEGIN_ASCII
partialFraction is implemented in pfr.spad
#+END_ASCII

*** Example 1.3.7 FullPartialFraction
#+BEGIN_SRC axiom
fullPartialFraction f
#+END_SRC

#+RESULTS:
#+begin_example
-> fullPartialFraction f

     3                  1
     ─                  ─
     2         2        2
   ───── + ──────── - ─────
   ? - 1          2   ? + 1
           (? - 1)
Type: FullPartialFractionExpansion(Fraction(Integer),SparseUnivariatePolynomial(Fraction(Integer)))

#+end_example

#+BEGIN_ASCII
fullPartialFraction is implemented in fparfrac.spad
#+END_ASCII

** 1.4 Resultants and Subresultants
[54] GTM.211-Lang.S.Algebra.Springer.2002.600dpi.T.934s.KA.MAt.djvu
Chapter IV § 8, p200.

*** Definition 1.4.1 Sylvester Matrix
#+BEGIN_QUOTE
defined in bezout.spad

[[~/github/fricas/src/algebra/bezout.spad::BEZOUT]]

BezoutMatrix is not used anywhere else in FriCAS.
#+END_QUOTE

