symbolic-integration-1-transcendental-functions.html

<div id="outline-container-orgab5159c" class="outline-4">
<h4 id="orgab5159c"><span class="section-number-4">3.3.1</span> Example 1.3.1 EuclideanDivision</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-axiom">a := x^<span style="color: #a45bad;">4</span> - <span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">3</span> - <span style="color: #a45bad;">6</span>*x^<span style="color: #a45bad;">2</span> + <span style="color: #a45bad;">12</span>*x + <span style="color: #a45bad;">15</span>;
b := x^<span style="color: #a45bad;">3</span> + x^<span style="color: #a45bad;">2</span> - <span style="color: #a45bad;">4</span>*x - <span style="color: #a45bad;">4</span>;
gcd<span style="color: #4f97d7;">(</span>a, b<span style="color: #4f97d7;">)</span>
gcd<span style="color: #4f97d7;">(</span>a, b<span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org3c680f4">
-&gt; a := x^4 - 2*x^3 - 6*x^2 + 12*x + 15;

                                                    Type: Polynomial(Integer)
-&gt; b := x^3 + x^2 - 4*x - 4;

                                                    Type: Polynomial(Integer)
-&gt; gcd(a, b)

   x + 1
                                                    Type: Polynomial(Integer)
-&gt; gcd(a, b)$UP(x, FRAC INT)

   x + 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))

</pre>

<pre class="example" id="org83db6bc">
gcd, like divide in last section, is also implemented in SUP in
poly.spad :
</pre>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> /fricas
grep <span style="color: #2d9574;">'gcd(p1, p2)'</span> src/algebra/poly.spad -A3
</pre>
</div>

<pre class="example">
gcd(p1, p2) ==
     gcdPolynomial(p1 pretend SparseUnivariatePolynomial R,
                   p2 pretend SparseUnivariatePolynomial R) pretend %

</pre>


<pre class="example" id="org17ba5c8">
TODO: NOTE:

add source code for ExtendedEuclidean

it's implemented in catdef.spad, EUCDOM, seems very very inefficient?
</pre>
</div>
</div>

<div id="outline-container-org004f811" class="outline-4">
<h4 id="org004f811"><span class="section-number-4">3.3.2</span> Example 1.3.2 ExtendedEuclidean</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-axiom">extendedEuclidean<span style="color: #4f97d7;">(</span>a, b, <span style="color: #a45bad;">5</span>*x+<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; extendedEuclidean(a, b, 5*x+5)$UP(x, FRAC INT)

                             2
   [coef1 = - x + 3,coef2 = x  - 6x + 10]
Type: Union(Record(coef1: UnivariatePolynomial(x,Fraction(Integer)),coef2: UnivariatePolynomial(x,Fraction(Integer))),...)

</pre>
</div>
</div>

<div id="outline-container-org306808d" class="outline-4">
<h4 id="org306808d"><span class="section-number-4">3.3.3</span> Example 1.3.3</h4>
</div>
<div id="outline-container-orgd5e1548" class="outline-4">
<h4 id="orgd5e1548"><span class="section-number-4">3.3.4</span> Example 1.3.4</h4>
<div class="outline-text-4" id="text-3-3-4">
<div class="org-src-container">
<pre class="src src-axiom">stg := extendedEuclidean<span style="color: #4f97d7;">(</span>a, b<span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>

s := stg.coef1
t := stg.coef2
g := stg.generator
qr:= divide<span style="color: #4f97d7;">(</span>x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span>,g<span style="color: #4f97d7;">)</span>

q := qr.quotient
r := qr.remainder
s := q*s

t := q*t

s*a+t*b = x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span>
</pre>
</div>

<pre class="example" id="orge7fdd99">
-&gt; stg := extendedEuclidean(a, b)$UP(x, FRAC INT)

              1     3         1  2   6
   [coef1 = - ─ x + ─,coef2 = ─ x  - ─ x + 2,generator = x + 1]
              5     5         5      5
Type: Record(coef1: UnivariatePolynomial(x,Fraction(Integer)),coef2: UnivariatePolynomial(x,Fraction(Integer)),generator: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; s := stg.coef1

     1     3
   - ─ x + ─
     5     5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; t := stg.coef2

   1  2   6
   ─ x  - ─ x + 2
   5      5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; g := stg.generator

   x + 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; qr:= divide(x^2-1,g)

   [quotient = x - 1,remainder = 0]
Type: Record(quotient: UnivariatePolynomial(x,Fraction(Integer)),remainder: UnivariatePolynomial(x,Fraction(Integer)))
-&gt; q := qr.quotient

   x - 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; r := qr.remainder

   0
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; s := q*s

     1  2   4     3
   - ─ x  + ─ x - ─
     5      5     5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; t := q*t

   1  3   7  2   16
   ─ x  - ─ x  + ── x - 2
   5      5       5
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; s*a+t*b = x^2-1

    2        2
   x  - 1 = x  - 1
                                Type: Equation(Polynomial(Fraction(Integer)))

</pre>
</div>
</div>

<div id="outline-container-orga636e31" class="outline-4">
<h4 id="orga636e31"><span class="section-number-4">3.3.5</span> Example 1.3.5</h4>
<div class="outline-text-4" id="text-3-3-5">
<div class="org-src-container">
<pre class="src src-axiom">extendedEuclidean<span style="color: #4f97d7;">(</span>a, b, x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; extendedEuclidean(a, b, x^2-1)$UP(x, FRAC INT)

              1  2   4     3         1  3   7  2   16
   [coef1 = - ─ x  + ─ x - ─,coef2 = ─ x  - ─ x  + ── x - 2]
              5      5     5         5      5       5
Type: Union(Record(coef1: UnivariatePolynomial(x,Fraction(Integer)),coef2: UnivariatePolynomial(x,Fraction(Integer))),...)

</pre>


<div class="ASCII" id="org6dbcb06">
<p>
NOTES by me:
</p>

<p>
How to use dioSolve to solve this equation?
</p>

</div>
</div>
</div>

<div id="outline-container-org13f58a5" class="outline-4">
<h4 id="org13f58a5"><span class="section-number-4">3.3.6</span> Example 1.3.6 PartialFraction</h4>
<div class="outline-text-4" id="text-3-3-6">
<div class="org-src-container">
<pre class="src src-axiom">x := monomial<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">SUP</span> <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span>;
f := <span style="color: #4f97d7;">(</span>x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">3</span>*x<span style="color: #4f97d7;">)</span>/<span style="color: #4f97d7;">(</span>x^<span style="color: #a45bad;">3</span>-x^<span style="color: #a45bad;">2</span>-x+<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>;
partialFraction f
</pre>
</div>

<pre class="example" id="org39e6409">
-&gt; x := monomial(1, 1)$SUP FRAC INT;

                          Type: SparseUnivariatePolynomial(Fraction(Integer))
-&gt; f := (x^2+3*x)/(x^3-x^2-x+1);

                Type: Fraction(SparseUnivariatePolynomial(Fraction(Integer)))
-&gt; partialFraction f

    3     1     1
    ─ ? + ─     ─
    2     2     2
   ──────── - ─────
          2   ? + 1
   (? - 1)
         Type: PartialFraction(SparseUnivariatePolynomial(Fraction(Integer)))

</pre>

<div class="ASCII" id="orgef46b68">
<p>
partialFraction is implemented in pfr.spad
</p>

</div>
</div>
</div>

<div id="outline-container-org5b6a5c3" class="outline-4">
<h4 id="org5b6a5c3"><span class="section-number-4">3.3.7</span> Example 1.3.7 FullPartialFraction</h4>
<div class="outline-text-4" id="text-3-3-7">
<div class="org-src-container">
<pre class="src src-axiom">fullPartialFraction f
</pre>
</div>

<pre class="example" id="org47dba63">
-&gt; fullPartialFraction f

     3                  1
     ─                  ─
     2         2        2
   ───── + ──────── - ─────
   ? - 1          2   ? + 1
           (? - 1)
Type: FullPartialFractionExpansion(Fraction(Integer),SparseUnivariatePolynomial(Fraction(Integer)))

</pre>

<div class="ASCII" id="org7ad01cd">
<p>
fullPartialFraction is implemented in fparfrac.spad
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-org555e396" class="outline-3">
<h3 id="org555e396"><span class="section-number-3">3.4</span> 1.4 Resultants and Subresultants</h3>
<div class="outline-text-3" id="text-3-4">
<p>
[54] GTM.211-Lang.S.Algebra.Springer.2002.600dpi.T.934s.KA.MAt.djvu
Chapter IV § 8, p200.
</p>
</div>

<div id="outline-container-orgf6fb9c9" class="outline-4">
<h4 id="orgf6fb9c9"><span class="section-number-4">3.4.1</span> Definition 1.4.1 Sylvester Matrix</h4>
<div class="outline-text-4" id="text-3-4-1">
<blockquote>
<p>
defined in bezout.spad
</p>

<p>
<a href="file:///fricas/src/algebra/bezout.spad">file:///fricas/src/algebra/bezout.spad</a> ::BEZOUT
</p>

<p>
BezoutMatrix is not used anywhere else in FriCAS.
</p>
</blockquote>
</div>
</div>
