symbolic-integration-1-transcendental-functions.org
*** Example 1.4.1 Resultant
#+BEGIN_SRC axiom
)clear all
T ==> UP(x, POLY INT)
A : T := 3*t*x^2 - t^3-4
B : T := x^2 + t^3*x - 9
)expose BezoutMatrix
sab:=sylvesterMatrix(A, B)

determinant sab

bezoutResultant(A, B)

resultant(A, B)
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> T ==> UP(x, POLY INT)
                                                                    Type: Void
-> A : T := 3*t*x^2 - t^3-4

        2    3
   3 t x  - t  - 4
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-> B : T := x^2 + t^3*x - 9

    2    3
   x  + t x - 9
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-> )expose BezoutMatrix
    BezoutMatrix is now explicitly exposed in frame initial
-> sab:=sylvesterMatrix(A, B)

   ┌             3              ┐
   │3 t   0   - t  - 4     0    │
   │                            │
   │                       3    │
   │ 0   3 t     0      - t  - 4│
   │                            │
   │      3                     │
   │ 1   t      - 9        0    │
   │                            │
   │              3             │
   └ 0    1      t        - 9   ┘
                                            Type: Matrix(Polynomial(Integer))
-> determinant sab

        10       7    6       4      3        2
   - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16
                                                    Type: Polynomial(Integer)
-> bezoutResultant(A, B)

        10       7    6       4      3        2
   - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16
                                                    Type: Polynomial(Integer)
-> resultant(A, B)

        10       7    6       4      3        2
   - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16
                                                    Type: Polynomial(Integer)

#+end_example

#+BEGIN_QUOTE
resultant is defined in prs.spad

[[~/github/fricas/src/algebra/prs.spad::396]]
#+END_QUOTE

*** Theorem 1.4.1 Resultant
[[~/github/fricas/src/algebra/prs.spad::400]]

*** Theorem 1.4.2 resultantEuclidean
[[~/github/fricas/src/algebra/prs.spad::41]]

[[~/github/fricas/src/algebra/prs.spad::426]]

#+BEGIN_SRC axiom
)expose PRS
resultantEuclidean(A, B)
#+END_SRC

#+RESULTS:
#+begin_example
-> )expose PRS
   PseudoRemainderSequence is already explicitly exposed in frame
      initial
-> resultantEuclidean(A, B)

               4       7    3
   [coef1 = 3 t x + 3 t  - t  + 27 t - 4,
                 5       4       2
    coef2 = - 9 t x + 3 t  - 81 t  + 12 t,
                     10       7    6       4      3        2
    resultant = - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16]
Type: Record(coef1: UnivariatePolynomial(x,Polynomial(Integer)),coef2: UnivariatePolynomial(x,Polynomial(Integer)),resultant: Polynomial(Integer))

#+end_example

*** Example 1.4.2 Subresultant
#+BEGIN_SRC axiom
)clear all
A := x^2 + 1;
B := x^2 - 1;
)expose BezoutMatrix
sylvesterMatrix(A, B)

)expose PseudoRemainderSequence
chainSubResultants(A, B)

-- or alternatively:
)expose SubResultantPackage
subresultantVector(A, B)

-- There is also:
T ==> NSMP(INT,OrderedVariableList[x]);
subResultantChain(A::T, B::T)

-- can not compute when degree(A) = degree(B)
)expose SturmHabichtPackage
subresultantSequence(A, B)
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> A := x^2 + 1;

                                                    Type: Polynomial(Integer)
-> B := x^2 - 1;

                                                    Type: Polynomial(Integer)
-> )expose BezoutMatrix
    BezoutMatrix is now explicitly exposed in frame initial
-> sylvesterMatrix(A, B)

   ┌1  0   1    0 ┐
   │              │
   │0  1   0    1 │
   │              │
   │1  0  - 1   0 │
   │              │
   └0  1   0   - 1┘
                                                        Type: Matrix(Integer)
-> )expose PseudoRemainderSequence
    PseudoRemainderSequence is now explicitly exposed in frame initial
-> chainSubResultants(A, B)

           2
   [4,- 2,x  - 1]
                                  Type: List(UnivariatePolynomial(x,Integer))
-> -- or alternatively:
-> )expose SubResultantPackage
     SubResultantPackage is already explicitly exposed in frame initial
-> subresultantVector(A, B)

           2      2
   [4,- 2,x  - 1,x  + 1]
                        Type: PrimitiveArray(UnivariatePolynomial(x,Integer))
-> -- There is also:
-> T ==> NSMP(INT,OrderedVariableList[x]);
                                                                     Type: Void
-> subResultantChain(A::T, B::T)

           2
   [4,- 2,x  - 1]
Type: List(NewSparseMultivariatePolynomial(Integer,OrderedVariableList([x])))
-> -- can not compute when degree(A) = degree(B)
-> )expose SturmHabichtPackage
     SturmHabichtPackage is now explicitly exposed in frame initial
-> subresultantSequence(A, B)

   >> Error detected within library code:
   subresultantSequence : degree(p1) <= degree(p2)


#+end_example

#+BEGIN_ASCII
NOTES BY ME:

SubResultantPackage is based on PseudoRemainderSequence,
but why write a wrapper on top of it?  See the interesting
comments in SubResultantPackage.
#+END_ASCII

*** Example 1.4.3
#+BEGIN_SRC axiom
)clear all
T ==> UP(x, POLY INT)
A:T := 3*t*x^2 - t^3-4
B:T := x^2 + t^3*x - 9
)expose PseudoRemainderSequence
chainSubResultants(A, B)
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> T ==> UP(x, POLY INT)
                                                                    Type: Void
-> A:T := 3*t*x^2 - t^3-4

        2    3
   3 t x  - t  - 4
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-> B:T := x^2 + t^3*x - 9

    2    3
   x  + t x - 9
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-> )expose PseudoRemainderSequence
    PseudoRemainderSequence is already explicitly exposed in frame
      initial
-> chainSubResultants(A, B)

         10       7    6       4      3        2
   [- 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16,
       4     3              2    3
    3 t x + t  - 27 t + 4, x  + t x - 9]
                      Type: List(UnivariatePolynomial(x,Polynomial(Integer)))

#+end_example

