symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org403d349" class="outline-4">
<h4 id="org403d349"><span class="section-number-4">3.4.2</span> Example 1.4.1 Resultant</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #e0211d; text-decoration: overline;">)</span>clear all
T ==&gt; <span style="color: #4f97d7;">UP</span><span style="color: #e0211d; text-decoration: overline;">(</span>x, <span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">INT</span><span style="color: #e0211d; text-decoration: overline;">)</span>
A : T := <span style="color: #a45bad;">3</span>*t*x^<span style="color: #a45bad;">2</span> - t^<span style="color: #a45bad;">3</span>-<span style="color: #a45bad;">4</span>
B : T := x^<span style="color: #a45bad;">2</span> + t^<span style="color: #a45bad;">3</span>*x - <span style="color: #a45bad;">9</span>
<span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">BezoutMatrix</span>
sab:=sylvesterMatrix<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>

determinant sab

bezoutResultant<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>

resultant<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>
</pre>
</div>

<pre class="example" id="orgac96d7e">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; T ==&gt; UP(x, POLY INT)
                                                                    Type: Void
-&gt; A : T := 3*t*x^2 - t^3-4

        2    3
   3 t x  - t  - 4
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-&gt; B : T := x^2 + t^3*x - 9

    2    3
   x  + t x - 9
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-&gt; )expose BezoutMatrix
    BezoutMatrix is now explicitly exposed in frame initial
-&gt; sab:=sylvesterMatrix(A, B)

   ┌             3              ┐
   │3 t   0   - t  - 4     0    │
   │                            │
   │                       3    │
   │ 0   3 t     0      - t  - 4│
   │                            │
   │      3                     │
   │ 1   t      - 9        0    │
   │                            │
   │              3             │
   └ 0    1      t        - 9   ┘
                                            Type: Matrix(Polynomial(Integer))
-&gt; determinant sab

        10       7    6       4      3        2
   - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16
                                                    Type: Polynomial(Integer)
-&gt; bezoutResultant(A, B)

        10       7    6       4      3        2
   - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16
                                                    Type: Polynomial(Integer)
-&gt; resultant(A, B)

        10       7    6       4      3        2
   - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16
                                                    Type: Polynomial(Integer)

</pre>

<blockquote>
<p>
resultant is defined in prs.spad
</p>

<p>
<a href="file:///fricas/src/algebra/prs.spad">file:///fricas/src/algebra/prs.spad</a> 396
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org77c9589" class="outline-4">
<h4 id="org77c9589"><span class="section-number-4">3.4.3</span> Theorem 1.4.1 Resultant</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
<a href="file:///fricas/src/algebra/prs.spad">file:///fricas/src/algebra/prs.spad</a> 400
</p>
</div>
</div>

<div id="outline-container-org49e34b2" class="outline-4">
<h4 id="org49e34b2"><span class="section-number-4">3.4.4</span> Theorem 1.4.2 resultantEuclidean</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
<a href="file:///fricas/src/algebra/prs.spad">file:///fricas/src/algebra/prs.spad</a> 41
</p>

<p>
<a href="file:///fricas/src/algebra/prs.spad">file:///fricas/src/algebra/prs.spad</a> 426
</p>

<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">PRS</span>
resultantEuclidean<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>
</pre>
</div>

<pre class="example" id="orgba75d8e">
-&gt; )expose PRS
   PseudoRemainderSequence is already explicitly exposed in frame
      initial
-&gt; resultantEuclidean(A, B)

               4       7    3
   [coef1 = 3 t x + 3 t  - t  + 27 t - 4,
                 5       4       2
    coef2 = - 9 t x + 3 t  - 81 t  + 12 t,
                     10       7    6       4      3        2
    resultant = - 3 t   - 12 t  + t  - 54 t  + 8 t  + 729 t  - 216 t + 16]
Type: Record(coef1: UnivariatePolynomial(x,Polynomial(Integer)),coef2: UnivariatePolynomial(x,Polynomial(Integer)),resultant: Polynomial(Integer))

</pre>
</div>
</div>

<div id="outline-container-org24b7ca2" class="outline-4">
<h4 id="org24b7ca2"><span class="section-number-4">3.4.5</span> Example 1.4.2 Subresultant</h4>
<div class="outline-text-4" id="text-3-4-5">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #e0211d; text-decoration: overline;">)</span>clear all
A := x^<span style="color: #a45bad;">2</span> + <span style="color: #a45bad;">1</span>;
B := x^<span style="color: #a45bad;">2</span> - <span style="color: #a45bad;">1</span>;
<span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">BezoutMatrix</span>
sylvesterMatrix<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>

<span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">PseudoRemainderSequence</span>
chainSubResultants<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- or alternatively:</span>
<span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">SubResultantPackage</span>
subresultantVector<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- There is also:</span>
T ==&gt; <span style="color: #4f97d7;">NSMP</span><span style="color: #e0211d; text-decoration: overline;">(</span><span style="color: #4f97d7;">INT</span>,<span style="color: #4f97d7;">OrderedVariableList</span><span style="color: #e0211d; text-decoration: overline;">[</span>x<span style="color: #e0211d; text-decoration: overline;">])</span>;
subResultantChain<span style="color: #e0211d; text-decoration: overline;">(</span>A::T, B::T<span style="color: #e0211d; text-decoration: overline;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- can not compute when degree(A) = degree(B)</span>
<span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">SturmHabichtPackage</span>
subresultantSequence<span style="color: #e0211d; text-decoration: overline;">(</span>A, B<span style="color: #e0211d; text-decoration: overline;">)</span>
</pre>
</div>

<pre class="example" id="orgd0c1c23">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; A := x^2 + 1;

                                                    Type: Polynomial(Integer)
-&gt; B := x^2 - 1;

                                                    Type: Polynomial(Integer)
-&gt; )expose BezoutMatrix
    BezoutMatrix is now explicitly exposed in frame initial
-&gt; sylvesterMatrix(A, B)

   ┌1  0   1    0 ┐
   │              │
   │0  1   0    1 │
   │              │
   │1  0  - 1   0 │
   │              │
   └0  1   0   - 1┘
                                                        Type: Matrix(Integer)
-&gt; )expose PseudoRemainderSequence
    PseudoRemainderSequence is now explicitly exposed in frame initial
-&gt; chainSubResultants(A, B)

           2
   [4,- 2,x  - 1]
                                  Type: List(UnivariatePolynomial(x,Integer))
-&gt; -- or alternatively:
-&gt; )expose SubResultantPackage
     SubResultantPackage is already explicitly exposed in frame initial
-&gt; subresultantVector(A, B)

           2      2
   [4,- 2,x  - 1,x  + 1]
                        Type: PrimitiveArray(UnivariatePolynomial(x,Integer))
-&gt; -- There is also:
-&gt; T ==&gt; NSMP(INT,OrderedVariableList[x]);
                                                                     Type: Void
-&gt; subResultantChain(A::T, B::T)

           2
   [4,- 2,x  - 1]
Type: List(NewSparseMultivariatePolynomial(Integer,OrderedVariableList([x])))
-&gt; -- can not compute when degree(A) = degree(B)
-&gt; )expose SturmHabichtPackage
     SturmHabichtPackage is now explicitly exposed in frame initial
-&gt; subresultantSequence(A, B)

   &gt;&gt; Error detected within library code:
   subresultantSequence : degree(p1) &lt;= degree(p2)


</pre>

<div class="ASCII" id="org39d30f8">
<p>
NOTES BY ME:
</p>

<p>
SubResultantPackage is based on PseudoRemainderSequence,
but why write a wrapper on top of it?  See the interesting
comments in SubResultantPackage.
</p>

</div>
</div>
</div>
