symbolic-integration-1-transcendental-functions.org
** 1.5 Polynomial Remainder Sequences
*** Definition 1.5.1 Polynomial Remainder Sequence
[[~/github/fricas/src/algebra/prs.spad]]

*** Example 1.5.1
#+BEGIN_SRC axiom
resultant(x^2+1, x^2-1)
#+END_SRC

#+RESULTS:
: -> resultant(x^2+1, x^2-1)
:
:    4
:                                                         Type: PositiveInteger
:

*** Example 1.5.2
Same as Example 1.4.3.

** 1.6 Primitive Polynomials
*** Definition 1.6.1 content, primitivePart
#+BEGIN_SRC axiom
primitivePart(4*x+6)$POLY INT

primitivePart(4*x+6)$POLY FRAC INT
-- not the same with book
#+END_SRC

#+RESULTS:
#+begin_example
-> primitivePart(4*x+6)$POLY INT

   2 x + 3
                                                    Type: Polynomial(Integer)
-> primitivePart(4*x+6)$POLY FRAC INT

       3
   x + ─
       2
                                          Type: Polynomial(Fraction(Integer))
-> -- not the same with book

#+end_example

*** Definition 1.6.2 suqareFreePart
#+BEGIN_SRC axiom
-- UFD ?has? squareFree: % -> Factored(%)
#+END_SRC

** 1.7 Squarefree Factorization
*** Definition 1.7.2 squareFree
#+BEGIN_ASCII
NOTES BY ME:

squareFree is implemented in UnivariatePolynomialSquareFree
in poly.spad .
#+END_ASCII

[[~/github/fricas/src/algebra/poly.spad::1147]]

*** Example 1.7.1 squareFree
#+BEGIN_SRC axiom
squareFree(x^8+6*x^6+12*x^4+8*x^2)
#+END_SRC

#+RESULTS:
: -> squareFree(x^8+6*x^6+12*x^4+8*x^2)
:
:     2  2     3
:    x (x  + 2)
:                                           Type: Factored(Polynomial(Integer))
:

*** Example 1.7.2 squareFree
#+BEGIN_ASCII
NOTES BY ME:

In FriCAS, Yun's method is used when domain has CharacteristicZero.
#+END_ASCII

** Exercises
*** Exercise 1.1
#+BEGIN_SRC axiom
gcd(217, 413)
#+END_SRC

#+RESULTS:
: -> gcd(217, 413)
:
:    7
:                                                         Type: PositiveInteger
:

*** Exercise 1.2
#+BEGIN_SRC axiom
-- (a)
extendedEuclidean(12, 19, 1)
-- (b)
extendedEuclidean(3, 2, 5)
#+END_SRC

#+RESULTS:
#+begin_example
-> -- (a)
-> extendedEuclidean(12, 19, 1)

   [coef1 = 8,coef2 = - 5]
                       Type: Union(Record(coef1: Integer,coef2: Integer),...)
-> -- (b)
-> extendedEuclidean(3, 2, 5)

   [coef1 = 1,coef2 = 1]
                       Type: Union(Record(coef1: Integer,coef2: Integer),...)

#+end_example

#+BEGIN_SRC axiom
-- or solve by Diophantine theory:
dioSolve(12*x-19*y=1)
-- The answer has to be positive?

dioSolve(3*x+2*y=5)
#+END_SRC

#+RESULTS:
#+begin_example
-> -- or solve by Diophantine theory:
-> dioSolve(12*x-19*y=1)

   [varOrder = [x,y],inhom = [[8,5]],hom = [[19,12]]]
Type: Record(varOrder: List(Symbol),inhom: Union(List(Vector(NonNegativeInteger)),"failed"),hom: List(Vector(NonNegativeInteger)))
-> -- The answer has to be positive?
-> dioSolve(3*x+2*y=5)

   [varOrder = [x,y],inhom = [[1,1]],hom = []]
Type: Record(varOrder: List(Symbol),inhom: Union(List(Vector(NonNegativeInteger)),"failed"),hom: List(Vector(NonNegativeInteger)))

#+end_example

*** Exercise 1.3
#+BEGIN_SRC axiom
inv(14)$(PrimeField 37)
#+END_SRC

#+RESULTS:
: -> inv(14)$(PrimeField 37)
:
:    8
:                                                          Type: PrimeField(37)
:

*** Exercise 1.4
#+BEGIN_SRC axiom
gcd(2*x^3 - 19/5*x^2 - x + 6/5, x^2 + 1/3*x - 14/3)
#+END_SRC

#+RESULTS:
: -> gcd(2*x^3 - 19/5*x^2 - x + 6/5, x^2 + 1/3*x - 14/3)
:
:    x - 2
:                                           Type: Polynomial(Fraction(Integer))
:

