symbolic-integration-1-transcendental-functions.org
*** Exercise 1.5
#+BEGIN_SRC axiom
pseudoDivide(x^4 - 7*x + 7, 3*x^2 - 7)
#+END_SRC

#+RESULTS:
: -> pseudoDivide(x^4 - 7*x + 7, 3*x^2 - 7)
:
:                              2
:    [coef = 27, quotient = 9 x  + 21, remainder = - 189 x + 336]
: Type: Record(coef: Integer,quotient: UnivariatePolynomial(x,Integer),remainder: UnivariatePolynomial(x,Integer))
:

*** Exercise 1.6
#+BEGIN_SRC axiom
a := 7*x^5 + 4*x^3 + 2*x + 1
b := 2*x^3 + 3
divide(a,b)$UP(x, PrimeField 5)

divide(a,b)$UP(x, PrimeField 11)

pseudoDivide(a,b)$UP(x, INT)

divide(a,b)$UP(x, FRAC INT)
#+END_SRC

#+RESULTS:
#+begin_example
-> a := 7*x^5 + 4*x^3 + 2*x + 1

      5      3
   7 x  + 4 x  + 2 x + 1
                                                    Type: Polynomial(Integer)
-> b := 2*x^3 + 3

      3
   2 x  + 3
                                                    Type: Polynomial(Integer)
-> divide(a,b)$UP(x, PrimeField 5)

                2                     2
   [quotient = x  + 2, remainder = 2 x  + 2 x]
Type: Record(quotient: UnivariatePolynomial(x,PrimeField(5)),remainder: UnivariatePolynomial(x,PrimeField(5)))
-> divide(a,b)$UP(x, PrimeField 11)

                  2                     2
   [quotient = 9 x  + 2, remainder = 6 x  + 2 x + 6]
Type: Record(quotient: UnivariatePolynomial(x,PrimeField(11)),remainder: UnivariatePolynomial(x,PrimeField(11)))
-> pseudoDivide(a,b)$UP(x, INT)

                             2                         2
   [coef = 8, quotient = 28 x  + 16, remainder = - 84 x  + 16 x - 40]
Type: Record(coef: Integer,quotient: UnivariatePolynomial(x,Integer),remainder: UnivariatePolynomial(x,Integer))
-> divide(a,b)$UP(x, FRAC INT)

               7  2                    21  2
   [quotient = ─ x  + 2, remainder = - ── x  + 2 x - 5]
               2                        2
Type: Record(quotient: UnivariatePolynomial(x,Fraction(Integer)),remainder: UnivariatePolynomial(x,Fraction(Integer)))

#+end_example

*** Exercise 1.7
#+BEGIN_SRC axiom
)clear all
T ==> UP(x, POLY INT)

a:T := x^4 + x^3 - t
b:T := x^3 + 2*x^2 + 3*t*x - t + 1

)expose PseudoRemainderSequence
chainSubResultants(a,b)
#+END_SRC

#+RESULTS:
#+begin_example
-> )clear all
   All user variables and function definitions have been cleared.
-> T ==> UP(x, POLY INT)
                                                                    Type: Void
-> a:T := x^4 + x^3 - t

    4    3
   x  + x  - t
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-> b:T := x^3 + 2*x^2 + 3*t*x - t + 1

    3      2
   x  + 2 x  + 3 t x - t + 1
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-> )expose PseudoRemainderSequence
    PseudoRemainderSequence is already explicitly exposed in frame
      initial
-> chainSubResultants(a,b)

          5       4       3      2
   [- 81 t  - 26 t  + 54 t  + 3 t  - 11 t + 2,
         3      2                   3    2
    (27 t  - 2 t  - 11 t + 3)x - 9 t  + t  + 4 t - 1,
                2                          3      2
    (- 3 t + 2)x  + (4 t - 1)x - 2 t + 1, x  + 2 x  + 3 t x - t + 1]
                      Type: List(UnivariatePolynomial(x,Polynomial(Integer)))

#+end_example

*** Exercise 1.8
#+BEGIN_SRC axiom
-- (a)
gcd(4*x^4+13*x^3+15*x^2+7*x+1,2*x^3+x^2-4*x-3)$UP(x, FRAC INT)
-- (b)
gcd(4*x^4+13*x^3+15*x^2+7*x+1,2*x^3+x^2-4*x-3)$UP(x, INT)
#+END_SRC

#+RESULTS:
#+begin_example
-> -- (a)
-> gcd(4*x^4+13*x^3+15*x^2+7*x+1,2*x^3+x^2-4*x-3)$UP(x, FRAC INT)

    2
   x  + 2 x + 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-> -- (b)
-> gcd(4*x^4+13*x^3+15*x^2+7*x+1,2*x^3+x^2-4*x-3)$UP(x, INT)

    2
   x  + 2 x + 1
                                        Type: UnivariatePolynomial(x,Integer)

#+end_example

*** Exercise 1.9
#+BEGIN_SRC axiom
squareFree (x^8-5*x^6+6*x^4+4*x^2-8)
#+END_SRC

#+RESULTS:
: -> squareFree (x^8-5*x^6+6*x^4+4*x^2-8)
:
:      2     3  2
:    (x  - 2) (x  + 1)
:                                           Type: Factored(Polynomial(Integer))
:
