symbolic-integration-1-transcendental-functions.html

<div id="outline-container-org4b0d893" class="outline-4">
<h4 id="org4b0d893"><span class="section-number-4">3.8.5</span> Exercise 1.5</h4>
<div class="outline-text-4" id="text-3-8-5">
<div class="org-src-container">
<pre class="src src-axiom">pseudoDivide<span style="color: #4f97d7;">(</span>x^<span style="color: #a45bad;">4</span> - <span style="color: #a45bad;">7</span>*x + <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">3</span>*x^<span style="color: #a45bad;">2</span> - <span style="color: #a45bad;">7</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; pseudoDivide(x^4 - 7*x + 7, 3*x^2 - 7)

                             2
   [coef = 27, quotient = 9 x  + 21, remainder = - 189 x + 336]
Type: Record(coef: Integer,quotient: UnivariatePolynomial(x,Integer),remainder: UnivariatePolynomial(x,Integer))

</pre>
</div>
</div>

<div id="outline-container-org1edb076" class="outline-4">
<h4 id="org1edb076"><span class="section-number-4">3.8.6</span> Exercise 1.6</h4>
<div class="outline-text-4" id="text-3-8-6">
<div class="org-src-container">
<pre class="src src-axiom">a := <span style="color: #a45bad;">7</span>*x^<span style="color: #a45bad;">5</span> + <span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">3</span> + <span style="color: #a45bad;">2</span>*x + <span style="color: #a45bad;">1</span>
b := <span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">3</span> + <span style="color: #a45bad;">3</span>
divide<span style="color: #4f97d7;">(</span>a,b<span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">PrimeField</span> <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>

divide<span style="color: #4f97d7;">(</span>a,b<span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">PrimeField</span> <span style="color: #a45bad;">11</span><span style="color: #4f97d7;">)</span>

pseudoDivide<span style="color: #4f97d7;">(</span>a,b<span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>

divide<span style="color: #4f97d7;">(</span>a,b<span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org6f848c4">
-&gt; a := 7*x^5 + 4*x^3 + 2*x + 1

      5      3
   7 x  + 4 x  + 2 x + 1
                                                    Type: Polynomial(Integer)
-&gt; b := 2*x^3 + 3

      3
   2 x  + 3
                                                    Type: Polynomial(Integer)
-&gt; divide(a,b)$UP(x, PrimeField 5)

                2                     2
   [quotient = x  + 2, remainder = 2 x  + 2 x]
Type: Record(quotient: UnivariatePolynomial(x,PrimeField(5)),remainder: UnivariatePolynomial(x,PrimeField(5)))
-&gt; divide(a,b)$UP(x, PrimeField 11)

                  2                     2
   [quotient = 9 x  + 2, remainder = 6 x  + 2 x + 6]
Type: Record(quotient: UnivariatePolynomial(x,PrimeField(11)),remainder: UnivariatePolynomial(x,PrimeField(11)))
-&gt; pseudoDivide(a,b)$UP(x, INT)

                             2                         2
   [coef = 8, quotient = 28 x  + 16, remainder = - 84 x  + 16 x - 40]
Type: Record(coef: Integer,quotient: UnivariatePolynomial(x,Integer),remainder: UnivariatePolynomial(x,Integer))
-&gt; divide(a,b)$UP(x, FRAC INT)

               7  2                    21  2
   [quotient = ─ x  + 2, remainder = - ── x  + 2 x - 5]
               2                        2
Type: Record(quotient: UnivariatePolynomial(x,Fraction(Integer)),remainder: UnivariatePolynomial(x,Fraction(Integer)))

</pre>
</div>
</div>

<div id="outline-container-org577bc0a" class="outline-4">
<h4 id="org577bc0a"><span class="section-number-4">3.8.7</span> Exercise 1.7</h4>
<div class="outline-text-4" id="text-3-8-7">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #e0211d; text-decoration: overline;">)</span>clear all
T ==&gt; <span style="color: #4f97d7;">UP</span><span style="color: #e0211d; text-decoration: overline;">(</span>x, <span style="color: #4f97d7;">POLY</span> <span style="color: #4f97d7;">INT</span><span style="color: #e0211d; text-decoration: overline;">)</span>

a:T := x^<span style="color: #a45bad;">4</span> + x^<span style="color: #a45bad;">3</span> - t
b:T := x^<span style="color: #a45bad;">3</span> + <span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">2</span> + <span style="color: #a45bad;">3</span>*t*x - t + <span style="color: #a45bad;">1</span>

<span style="color: #e0211d; text-decoration: overline;">)</span>expose <span style="color: #a45bad;">PseudoRemainderSequence</span>
chainSubResultants<span style="color: #e0211d; text-decoration: overline;">(</span>a,b<span style="color: #e0211d; text-decoration: overline;">)</span>
</pre>
</div>

<pre class="example" id="orge864321">
-&gt; )clear all
   All user variables and function definitions have been cleared.
-&gt; T ==&gt; UP(x, POLY INT)
                                                                    Type: Void
-&gt; a:T := x^4 + x^3 - t

    4    3
   x  + x  - t
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-&gt; b:T := x^3 + 2*x^2 + 3*t*x - t + 1

    3      2
   x  + 2 x  + 3 t x - t + 1
                            Type: UnivariatePolynomial(x,Polynomial(Integer))
-&gt; )expose PseudoRemainderSequence
    PseudoRemainderSequence is already explicitly exposed in frame
      initial
-&gt; chainSubResultants(a,b)

          5       4       3      2
   [- 81 t  - 26 t  + 54 t  + 3 t  - 11 t + 2,
         3      2                   3    2
    (27 t  - 2 t  - 11 t + 3)x - 9 t  + t  + 4 t - 1,
                2                          3      2
    (- 3 t + 2)x  + (4 t - 1)x - 2 t + 1, x  + 2 x  + 3 t x - t + 1]
                      Type: List(UnivariatePolynomial(x,Polynomial(Integer)))

</pre>
</div>
</div>

<div id="outline-container-orgdfd72a0" class="outline-4">
<h4 id="orgdfd72a0"><span class="section-number-4">3.8.8</span> Exercise 1.8</h4>
<div class="outline-text-4" id="text-3-8-8">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- (a)</span>
gcd<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">4</span>+<span style="color: #a45bad;">13</span>*x^<span style="color: #a45bad;">3</span>+<span style="color: #a45bad;">15</span>*x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">7</span>*x+<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">3</span>+x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">4</span>*x-<span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">FRAC</span> <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- (b)</span>
gcd<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">4</span>+<span style="color: #a45bad;">13</span>*x^<span style="color: #a45bad;">3</span>+<span style="color: #a45bad;">15</span>*x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">7</span>*x+<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">3</span>+x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">4</span>*x-<span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>$<span style="color: #4f97d7;">UP</span><span style="color: #4f97d7;">(</span>x, <span style="color: #4f97d7;">INT</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgbba34a9">
-&gt; -- (a)
-&gt; gcd(4*x^4+13*x^3+15*x^2+7*x+1,2*x^3+x^2-4*x-3)$UP(x, FRAC INT)

    2
   x  + 2 x + 1
                              Type: UnivariatePolynomial(x,Fraction(Integer))
-&gt; -- (b)
-&gt; gcd(4*x^4+13*x^3+15*x^2+7*x+1,2*x^3+x^2-4*x-3)$UP(x, INT)

    2
   x  + 2 x + 1
                                        Type: UnivariatePolynomial(x,Integer)

</pre>
</div>
</div>

<div id="outline-container-orgfff3d53" class="outline-4">
<h4 id="orgfff3d53"><span class="section-number-4">3.8.9</span> Exercise 1.9</h4>
<div class="outline-text-4" id="text-3-8-9">
<div class="org-src-container">
<pre class="src src-axiom">squareFree <span style="color: #4f97d7;">(</span>x^<span style="color: #a45bad;">8</span>-<span style="color: #a45bad;">5</span>*x^<span style="color: #a45bad;">6</span>+<span style="color: #a45bad;">6</span>*x^<span style="color: #a45bad;">4</span>+<span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">8</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; squareFree (x^8-5*x^6+6*x^4+4*x^2-8)

     2     3  2
   (x  - 2) (x  + 1)
                                          Type: Factored(Polynomial(Integer))

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-25 Thu 20:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>